{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\jtvalderrama.github.io\stata1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}23 Dec 2022, 01:43:39
{txt}
{com}. //_1
. clear all
{res}{txt}
{com}. //_2
. clear all // Liberar el espacio de trabajo
{res}{txt}
{com}. 
. // Liberar el espacio de trabajo
. 
. clear all
{res}{txt}
{com}. 
. * Liberar el espacio de trabajo
. 
. clear all
{res}{txt}
{com}. //_3
. cd "C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\MATERIALES\sesion1"
{res}C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\MATERIALES\sesion1
{txt}
{com}. pwd
{res}C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\MATERIALES\sesion1
{txt}
{com}. //_4
. import delimited using "NOTAS.csv", clear varnames(1)
{res}{text}(6 vars, 38 obs)

{com}. //_5
. browse
{txt}
{com}. //_6q
. quietly{c -(}
{txt}
{com}. //_7
. save "ecv18r.dta", replace
{txt}file ecv18r.dta saved

{com}. //_8
. use "ecv18r.dta", clear
{txt}
{com}. //_9
. codebook 

{txt}{hline}
{res}id{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}byte{txt})

{col 18}range:  [{res}1{txt},{res}38{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}38{col 51}{txt}missing .:  {res}0{txt}/{res}38

{txt}{col 19}mean:{res}{col 26}    19.5
{txt}{col 15}std. dev:{res}{col 26} 11.1131

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}       4{col 37}      10{col 47}    19.5{col 57}      29{col 67}      35

{txt}{hline}
{res}ex1{right:Ex1}
{txt}{hline}

{col 19}type:  string ({res}str5{txt})

{col 10}unique values:  {res}5{col 51}{txt}missing "":  {res}0{txt}/{res}38

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         3{col 33}"10,00"
{col 21}         5{col 33}"15,00"
{col 21}        10{col 33}"16,00"
{col 21}         5{col 33}"18,00"
{col 21}        15{col 33}"20,00"

{txt}{hline}
{res}ex2{right:Ex2}
{txt}{hline}

{col 19}type:  string ({res}str5{txt})

{col 10}unique values:  {res}14{col 51}{txt}missing "":  {res}0{txt}/{res}38

{txt}{col 15}examples:  {res}"12,00"
{col 26}"14,00"
{col 26}"15,00"
{col 26}"19,00"

{txt}{hline}
{res}ex3{right:Ex3}
{txt}{hline}

{col 19}type:  string ({res}str5{txt})

{col 10}unique values:  {res}10{col 51}{txt}missing "":  {res}0{txt}/{res}38

{txt}{col 15}examples:  {res}"14,00"
{col 26}"16,00"
{col 26}"17,00"
{col 26}"18,00"

{txt}{hline}
{res}ex4{right:Ex4}
{txt}{hline}

{col 19}type:  string ({res}str5{txt})

{col 10}unique values:  {res}15{col 51}{txt}missing "":  {res}0{txt}/{res}38

{txt}{col 15}examples:  {res}"12,00"
{col 26}"15,00"
{col 26}"19,00"
{col 26}"7,00"

{txt}{hline}
{res}ex5{right:Ex5}
{txt}{hline}

{col 19}type:  string ({res}str5{txt})

{col 10}unique values:  {res}7{col 51}{txt}missing "":  {res}0{txt}/{res}38

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         5{col 33}"10,00"
{col 21}        10{col 33}"11,00"
{col 21}         3{col 33}"15,00"
{col 21}         5{col 33}"16,00"
{col 21}         5{col 33}"18,00"
{col 21}         5{col 33}"19,00"
{col 21}         5{col 33}"20,00"
{txt}
{com}. //_10
. sum

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}id {c |}{res}         38        19.5    11.11306          1         38
{txt}{space 9}ex1 {c |}{res}          0
{txt}{space 9}ex2 {c |}{res}          0
{txt}{space 9}ex3 {c |}{res}          0
{txt}{space 9}ex4 {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 9}ex5 {c |}{res}          0
{txt}
{com}. //_11
. tabulate rb210 if rb090 == 2
{err}variable {bf}rb210{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{com}. 
{txt}end of do-file

{com}. do "C:\Users\jvald\AppData\Local\Temp\STD38ec_000000.tmp"
{txt}
{com}. cd "C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\jtvalderrama.github.io"
{res}C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\jtvalderrama.github.io
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\jvald\AppData\Local\Temp\STD38ec_000000.tmp"
{txt}
{com}. markstat using "curso_stata.stmd", strict mathjax bibliography
{res}{txt}
{com}. capture log close
{smcl}
{com}{sf}{ul off}