{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\jtvalderrama.github.io\stata1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Dec 2022, 22:52:02
{txt}
{com}. //_1
. clear all
{res}{txt}
{com}. //_2
. clear all // Liberar el espacio de trabajo
{res}{txt}
{com}. 
. // Liberar el espacio de trabajo
. 
. clear all
{res}{txt}
{com}. 
. * Liberar el espacio de trabajo
. 
. clear all
{res}{txt}
{com}. //_3
. cd "C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\MATERIALES\sesion1"
{res}C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\MATERIALES\sesion1
{txt}
{com}. pwd
{res}C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\MATERIALES\sesion1
{txt}
{com}. //_4
. import delimited using "NOTAS.csv", clear varnames(1)
{res}{text}(6 vars, 38 obs)

{com}. //_5
. browse
{txt}
{com}. //_6q
. quietly{c -(}
{txt}
{com}. //_7
. save "misnotas.dta", replace
{txt}file misnotas.dta saved

{com}. //_8
. use "misnotas.dta", clear
{txt}
{com}. //_9
. codebook ex1

{txt}{hline}
{res}ex1{right:Ex1}
{txt}{hline}

{col 19}type:  numeric ({res}byte{txt})

{col 18}range:  [{res}10{txt},{res}20{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}5{col 51}{txt}missing .:  {res}0{txt}/{res}38

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         3{col 33}10
{col 21}         5{col 33}15
{col 21}        10{col 33}16
{col 21}         5{col 33}18
{col 21}        15{col 33}20
{txt}
{com}. //_10
. sum ex1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}ex1 {c |}{res}         38    17.23684    2.917183         10         20
{txt}
{com}. //_11
. tabulate ex1 if ex1 > 10

        {txt}Ex1 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         15 {c |}{res}          5       14.29       14.29
{txt}         16 {c |}{res}         10       28.57       42.86
{txt}         18 {c |}{res}          5       14.29       57.14
{txt}         20 {c |}{res}         15       42.86      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         35      100.00
{txt}
{com}. //_12
. list ex1 in 1/10
{txt}
     {c TLC}{hline 5}{c TRC}
     {c |} {res}ex1 {txt}{c |}
     {c LT}{hline 5}{c RT}
  1. {c |} {res} 16 {txt}{c |}
  2. {c |} {res} 18 {txt}{c |}
  3. {c |} {res} 16 {txt}{c |}
  4. {c |} {res} 16 {txt}{c |}
  5. {c |} {res} 16 {txt}{c |}
     {c LT}{hline 5}{c RT}
  6. {c |} {res} 16 {txt}{c |}
  7. {c |} {res} 18 {txt}{c |}
  8. {c |} {res} 20 {txt}{c |}
  9. {c |} {res} 16 {txt}{c |}
 10. {c |} {res} 15 {txt}{c |}
     {c BLC}{hline 5}{c BRC}

{com}. //_13
. drop id
{txt}
{com}. //_14
. use "misnotas.dta", clear
{txt}
{com}. //_15
. label data "ECV-Datos básicos de la persona"
{txt}
{com}. //_16
. label var ex1 "Examen 1"
{txt}
{com}. //_17
. label define sexo_lab 1 "Hombre" 2 "Mujer"
{txt}
{com}. label values ex1 sexo_lab
{txt}
{com}. //_18
. rename ex1 examen1
{res}{txt}
{com}. //_19
. generate nota = (examen1+ex2+ex3+ex4+ex5)/4
{txt}
{com}. 
. // Etiquetamos la variable
. 
. label var nota "Nota del curso"
{txt}
{com}. 
. //  Observamos los estadísticos descriptivos de la nueva variable
. 
. summarize nota

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}nota {c |}{res}         38    18.60526    3.527705       12.5       24.5
{txt}
{com}. //_20
. generate gnota = 1 if nota <= 10
{txt}(38 missing values generated)

{com}. replace gnota = 2 if nota >= 11 & nota <= 15
{txt}(7 real changes made)

{com}. replace gnota = 3 if edad >= 16 
{err}edad not found
{txt}{search r(111), local:r(111);}

end of do-file

{com}. 
{txt}end of do-file

{com}. 