{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\jtvalderrama.github.io\stata1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Jan 2023, 17:05:12
{txt}
{com}. //_1
.  use "C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\MATERIALES\sesion1\sumaria-2021.dta"
{txt}
{com}.  reg gashog2d ingmo2hd

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    34,245
{txt}{hline 13}{c +}{hline 34}   F(1, 34243)     = {res} 32793.52
{txt}       Model {c |} {res} 6.7016e+12         1  6.7016e+12   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 6.9978e+12    34,243   204356239   {txt}R-squared       ={res}    0.4892
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4892
{txt}       Total {c |} {res} 1.3699e+13    34,244   400050578   {txt}Root MSE        =   {res}  14295

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    gashog2d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}ingmo2hd {c |}{col 14}{res}{space 2} .5138716{col 26}{space 2} .0028377{col 37}{space 1}  181.09{col 46}{space 3}0.000{col 54}{space 4} .5083097{col 67}{space 3} .5194336
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  13009.4{col 26}{space 2} 103.9351{col 37}{space 1}  125.17{col 46}{space 3}0.000{col 54}{space 4} 12805.68{col 67}{space 3} 13213.11
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_2
. clear all
{res}{txt}
{com}. //_3
. clear all // Liberar el espacio de trabajo
{res}{txt}
{com}. 
. // Liberar el espacio de trabajo
. 
. clear all
{res}{txt}
{com}. 
. * Liberar el espacio de trabajo
. 
. clear all
{res}{txt}
{com}. //_4
. cd "C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\MATERIALES\sesion1"
{res}C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\MATERIALES\sesion1
{txt}
{com}. pwd
{res}C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\MATERIALES\sesion1
{txt}
{com}. //_5
. import delimited using "NOTAS.csv", clear varnames(1)
{res}{text}(6 vars, 38 obs)

{com}. //_6
. browse
{txt}
{com}. //_7q
. quietly{c -(}
{txt}
{com}. //_8
. save "misnotas.dta", replace
{txt}file misnotas.dta saved

{com}. //_9
. use "misnotas.dta", clear
{txt}
{com}. //_10
. codebook ex1

{txt}{hline}
{res}ex1{right:Ex1}
{txt}{hline}

{col 19}type:  numeric ({res}byte{txt})

{col 18}range:  [{res}10{txt},{res}20{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}5{col 51}{txt}missing .:  {res}0{txt}/{res}38

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}         3{col 33}10
{col 21}         5{col 33}15
{col 21}        10{col 33}16
{col 21}         5{col 33}18
{col 21}        15{col 33}20
{txt}
{com}. //_11
. sum ex1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}ex1 {c |}{res}         38    17.23684    2.917183         10         20
{txt}
{com}. //_12
. tabulate ex1 if ex1 > 10

        {txt}Ex1 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         15 {c |}{res}          5       14.29       14.29
{txt}         16 {c |}{res}         10       28.57       42.86
{txt}         18 {c |}{res}          5       14.29       57.14
{txt}         20 {c |}{res}         15       42.86      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         35      100.00
{txt}
{com}. //_13
. list ex1 in 1/10
{txt}
     {c TLC}{hline 5}{c TRC}
     {c |} {res}ex1 {txt}{c |}
     {c LT}{hline 5}{c RT}
  1. {c |} {res} 16 {txt}{c |}
  2. {c |} {res} 18 {txt}{c |}
  3. {c |} {res} 16 {txt}{c |}
  4. {c |} {res} 16 {txt}{c |}
  5. {c |} {res} 16 {txt}{c |}
     {c LT}{hline 5}{c RT}
  6. {c |} {res} 16 {txt}{c |}
  7. {c |} {res} 18 {txt}{c |}
  8. {c |} {res} 20 {txt}{c |}
  9. {c |} {res} 16 {txt}{c |}
 10. {c |} {res} 15 {txt}{c |}
     {c BLC}{hline 5}{c BRC}

{com}. //_14
. drop id
{txt}
{com}. //_15
. use "misnotas.dta", clear
{txt}
{com}. //_16
. label data "ECV-Datos b치sicos de la persona"
{txt}
{com}. //_17
. label var ex1 "Examen 1"
{txt}
{com}. //_18
. label define sexo_lab 1 "Hombre" 2 "Mujer"
{txt}
{com}. label values ex1 sexo_lab
{txt}
{com}. //_19
. rename ex1 examen1
{res}{txt}
{com}. //_20
. generate nota = (examen1+ex2+ex3+ex4+ex5)/4
{txt}
{com}. 
. // Etiquetamos la variable
. 
. label var nota "Nota del curso"
{txt}
{com}. 
. //  Observamos los estad칤sticos descriptivos de la nueva variable
. 
. summarize nota

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}nota {c |}{res}         38    18.60526    3.527705       12.5       24.5
{txt}
{com}. //_21
. generate gnota = 1 if nota <= 10
{txt}(38 missing values generated)

{com}. replace gnota = 2 if nota >= 11 & nota <= 15
{txt}(7 real changes made)

{com}. replace gnota = 3 if nota >= 16 
{txt}(27 real changes made)

{com}. 
. // Etiqueamos la variable y sus valores
. 
. label var gnota "Grupo de nota"
{txt}
{com}. label define gnota_lab 1 "Menor que 10" 2 "De 11 a 15" 3 "De 16 y m치s"
{txt}
{com}. label values gnota gnota_lab
{txt}
{com}. 
. tabulate gnota

    {txt}Grupo de {c |}
        nota {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
  De 11 a 15 {c |}{res}          7       20.59       20.59
{txt} De 16 y m치s {c |}{res}         27       79.41      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}         34      100.00
{txt}
{com}. //_22
. recode gnota (1  = 1) (2 3 = 2)
{txt}(gnota: 27 changes made)

{com}. 
. // Etiquetamos la nueva variable y sus valores
. 
. label drop gnota_lab
{txt}
{com}. label define gnota_lab 1 "Menos de 10" 2 "11 y m치s"
{txt}
{com}. label values gnota gnota_lab
{txt}
{com}. 
. tabulate gnota

   {txt}Grupo de {c |}
       nota {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   11 y m치s {c |}{res}         34      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}         34      100.00
{txt}
{com}. //_23
. egen notam = mean(nota)
{txt}
{com}. //_24q
. quietly{c -(}
{txt}
{com}. //_25
. tabulate p524a1,m

{txt}쯖u烱to fue {c |}
 su ingreso {c |}
   total en {c |}
 el(la) ... {c |}
  anterior, {c |}
 incluyendo {c |}
  las horas {c |}
     extras {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          5 {c |}{res}          2        0.00        0.00
{txt}          7 {c |}{res}          1        0.00        0.00
{txt}         10 {c |}{res}         24        0.03        0.03
{txt}         12 {c |}{res}          5        0.01        0.04
{txt}         13 {c |}{res}          1        0.00        0.04
{txt}         14 {c |}{res}          1        0.00        0.04
{txt}         15 {c |}{res}         36        0.04        0.08
{txt}         16 {c |}{res}          2        0.00        0.08
{txt}         20 {c |}{res}        105        0.12        0.20
{txt}         21 {c |}{res}          1        0.00        0.21
{txt}         24 {c |}{res}          1        0.00        0.21
{txt}         25 {c |}{res}         56        0.06        0.27
{txt}         26 {c |}{res}          2        0.00        0.27
{txt}         27 {c |}{res}          2        0.00        0.28
{txt}         28 {c |}{res}          2        0.00        0.28
{txt}         30 {c |}{res}        160        0.18        0.46
{txt}         32 {c |}{res}          1        0.00        0.46
{txt}         35 {c |}{res}         37        0.04        0.51
{txt}         36 {c |}{res}          2        0.00        0.51
{txt}         38 {c |}{res}          1        0.00        0.51
{txt}         39 {c |}{res}          2        0.00        0.51
{txt}         40 {c |}{res}        173        0.20        0.71
{txt}         42 {c |}{res}          2        0.00        0.71
{txt}         43 {c |}{res}          4        0.00        0.72
{txt}         44 {c |}{res}          1        0.00        0.72
{txt}         45 {c |}{res}         28        0.03        0.75
{txt}         46 {c |}{res}          3        0.00        0.75
{txt}         48 {c |}{res}          3        0.00        0.76
{txt}         50 {c |}{res}        212        0.24        1.00
{txt}         54 {c |}{res}          1        0.00        1.00
{txt}         55 {c |}{res}          4        0.00        1.01
{txt}         56 {c |}{res}          2        0.00        1.01
{txt}         57 {c |}{res}          1        0.00        1.01
{txt}         60 {c |}{res}        307        0.35        1.37
{txt}         63 {c |}{res}          2        0.00        1.37
{txt}         65 {c |}{res}          2        0.00        1.37
{txt}         67 {c |}{res}          1        0.00        1.37
{txt}         68 {c |}{res}          1        0.00        1.37
{txt}         70 {c |}{res}         92        0.11        1.48
{txt}         72 {c |}{res}          6        0.01        1.48
{txt}         74 {c |}{res}          4        0.00        1.49
{txt}         75 {c |}{res}         82        0.09        1.58
{txt}         78 {c |}{res}          3        0.00        1.59
{txt}         80 {c |}{res}        216        0.25        1.84
{txt}         83 {c |}{res}          1        0.00        1.84
{txt}         84 {c |}{res}          5        0.01        1.84
{txt}         85 {c |}{res}          1        0.00        1.84
{txt}         87 {c |}{res}          2        0.00        1.85
{txt}         90 {c |}{res}        246        0.28        2.13
{txt}         91 {c |}{res}          1        0.00        2.13
{txt}         92 {c |}{res}          2        0.00        2.13
{txt}         95 {c |}{res}          3        0.00        2.14
{txt}         96 {c |}{res}          5        0.01        2.14
{txt}        100 {c |}{res}        368        0.42        2.57
{txt}        102 {c |}{res}          2        0.00        2.57
{txt}        103 {c |}{res}          1        0.00        2.57
{txt}        105 {c |}{res}         48        0.06        2.63
{txt}        108 {c |}{res}          6        0.01        2.63
{txt}        109 {c |}{res}          1        0.00        2.63
{txt}        110 {c |}{res}         12        0.01        2.65
{txt}        117 {c |}{res}          2        0.00        2.65
{txt}        120 {c |}{res}        525        0.60        3.25
{txt}        122 {c |}{res}          1        0.00        3.26
{txt}        124 {c |}{res}          2        0.00        3.26
{txt}        125 {c |}{res}         40        0.05        3.30
{txt}        126 {c |}{res}          4        0.00        3.31
{txt}        128 {c |}{res}          2        0.00        3.31
{txt}        129 {c |}{res}          1        0.00        3.31
{txt}        130 {c |}{res}         19        0.02        3.33
{txt}        132 {c |}{res}          2        0.00        3.34
{txt}        133 {c |}{res}          1        0.00        3.34
{txt}        135 {c |}{res}         26        0.03        3.37
{txt}        138 {c |}{res}          4        0.00        3.37
{txt}        140 {c |}{res}         94        0.11        3.48
{txt}        144 {c |}{res}          4        0.00        3.48
{txt}        145 {c |}{res}          1        0.00        3.49
{txt}        150 {c |}{res}        605        0.70        4.18
{txt}        155 {c |}{res}          4        0.00        4.19
{txt}        156 {c |}{res}          2        0.00        4.19
{txt}        160 {c |}{res}        144        0.17        4.36
{txt}        162 {c |}{res}          3        0.00        4.36
{txt}        165 {c |}{res}          8        0.01        4.37
{txt}        168 {c |}{res}          2        0.00        4.37
{txt}        170 {c |}{res}         16        0.02        4.39
{txt}        171 {c |}{res}          1        0.00        4.39
{txt}        173 {c |}{res}          6        0.01        4.40
{txt}        175 {c |}{res}         62        0.07        4.47
{txt}        180 {c |}{res}        510        0.59        5.06
{txt}        182 {c |}{res}          1        0.00        5.06
{txt}        185 {c |}{res}          4        0.00        5.06
{txt}        186 {c |}{res}          1        0.00        5.06
{txt}        187 {c |}{res}          1        0.00        5.06
{txt}        188 {c |}{res}          1        0.00        5.07
{txt}        189 {c |}{res}          1        0.00        5.07
{txt}        190 {c |}{res}          8        0.01        5.08
{txt}        192 {c |}{res}          3        0.00        5.08
{txt}        193 {c |}{res}          1        0.00        5.08
{txt}        195 {c |}{res}         14        0.02        5.10
{txt}        196 {c |}{res}          1        0.00        5.10
{txt}        197 {c |}{res}          1        0.00        5.10
{txt}        198 {c |}{res}          3        0.00        5.10
{txt}        199 {c |}{res}          1        0.00        5.10
{txt}        200 {c |}{res}        568        0.65        5.76
{txt}        202 {c |}{res}          1        0.00        5.76
{txt}        203 {c |}{res}          1        0.00        5.76
{txt}        204 {c |}{res}          3        0.00        5.76
{txt}        205 {c |}{res}          1        0.00        5.76
{txt}        208 {c |}{res}          1        0.00        5.77
{txt}        210 {c |}{res}        245        0.28        6.05
{txt}        215 {c |}{res}          4        0.00        6.05
{txt}        216 {c |}{res}          1        0.00        6.05
{txt}        217 {c |}{res}          4        0.00        6.06
{txt}        218 {c |}{res}          1        0.00        6.06
{txt}        220 {c |}{res}         59        0.07        6.13
{txt}        222 {c |}{res}          1        0.00        6.13
{txt}        225 {c |}{res}         18        0.02        6.15
{txt}        226 {c |}{res}          1        0.00        6.15
{txt}        228 {c |}{res}          3        0.00        6.15
{txt}        230 {c |}{res}         32        0.04        6.19
{txt}        232 {c |}{res}          2        0.00        6.19
{txt}        233 {c |}{res}          3        0.00        6.20
{txt}        234 {c |}{res}          5        0.01        6.20
{txt}        235 {c |}{res}          3        0.00        6.21
{txt}        236 {c |}{res}          1        0.00        6.21
{txt}        237 {c |}{res}          1        0.00        6.21
{txt}        239 {c |}{res}          1        0.00        6.21
{txt}        240 {c |}{res}        507        0.58        6.79
{txt}        245 {c |}{res}         18        0.02        6.81
{txt}        246 {c |}{res}          5        0.01        6.82
{txt}        247 {c |}{res}          1        0.00        6.82
{txt}        248 {c |}{res}          3        0.00        6.82
{txt}        250 {c |}{res}        419        0.48        7.31
{txt}        252 {c |}{res}          1        0.00        7.31
{txt}        253 {c |}{res}          1        0.00        7.31
{txt}        255 {c |}{res}          7        0.01        7.32
{txt}        256 {c |}{res}          2        0.00        7.32
{txt}        258 {c |}{res}          1        0.00        7.32
{txt}        260 {c |}{res}         35        0.04        7.36
{txt}        262 {c |}{res}          1        0.00        7.36
{txt}        265 {c |}{res}          1        0.00        7.36
{txt}        267 {c |}{res}          1        0.00        7.36
{txt}        270 {c |}{res}         63        0.07        7.44
{txt}        272 {c |}{res}          1        0.00        7.44
{txt}        273 {c |}{res}          1        0.00        7.44
{txt}        274 {c |}{res}          1        0.00        7.44
{txt}        275 {c |}{res}          8        0.01        7.45
{txt}        276 {c |}{res}          5        0.01        7.46
{txt}        277 {c |}{res}          1        0.00        7.46
{txt}        280 {c |}{res}        133        0.15        7.61
{txt}        283 {c |}{res}          1        0.00        7.61
{txt}        284 {c |}{res}          1        0.00        7.61
{txt}        285 {c |}{res}          2        0.00        7.61
{txt}        287 {c |}{res}          4        0.00        7.62
{txt}        288 {c |}{res}          1        0.00        7.62
{txt}        290 {c |}{res}         13        0.01        7.64
{txt}        293 {c |}{res}          3        0.00        7.64
{txt}        294 {c |}{res}          1        0.00        7.64
{txt}        295 {c |}{res}          5        0.01        7.65
{txt}        300 {c |}{res}        989        1.14        8.79
{txt}        302 {c |}{res}          3        0.00        8.79
{txt}        303 {c |}{res}          1        0.00        8.79
{txt}        304 {c |}{res}          1        0.00        8.79
{txt}        305 {c |}{res}          2        0.00        8.79
{txt}        306 {c |}{res}          2        0.00        8.80
{txt}        310 {c |}{res}          9        0.01        8.81
{txt}        312 {c |}{res}          2        0.00        8.81
{txt}        313 {c |}{res}          2        0.00        8.81
{txt}        314 {c |}{res}          2        0.00        8.81
{txt}        315 {c |}{res}          7        0.01        8.82
{txt}        317 {c |}{res}          1        0.00        8.82
{txt}        318 {c |}{res}          1        0.00        8.82
{txt}        320 {c |}{res}         58        0.07        8.89
{txt}        321 {c |}{res}          1        0.00        8.89
{txt}        322 {c |}{res}          8        0.01        8.90
{txt}        324 {c |}{res}          1        0.00        8.90
{txt}        325 {c |}{res}          8        0.01        8.91
{txt}        328 {c |}{res}          2        0.00        8.91
{txt}        330 {c |}{res}         24        0.03        8.94
{txt}        333 {c |}{res}          2        0.00        8.94
{txt}        335 {c |}{res}          2        0.00        8.95
{txt}        336 {c |}{res}          1        0.00        8.95
{txt}        340 {c |}{res}         22        0.03        8.97
{txt}        342 {c |}{res}          2        0.00        8.97
{txt}        343 {c |}{res}          1        0.00        8.98
{txt}        345 {c |}{res}         15        0.02        8.99
{txt}        346 {c |}{res}          3        0.00        9.00
{txt}        347 {c |}{res}          2        0.00        9.00
{txt}        348 {c |}{res}          1        0.00        9.00
{txt}        350 {c |}{res}        305        0.35        9.35
{txt}        351 {c |}{res}          1        0.00        9.35
{txt}        352 {c |}{res}          1        0.00        9.35
{txt}        355 {c |}{res}          1        0.00        9.35
{txt}        356 {c |}{res}          3        0.00        9.36
{txt}        360 {c |}{res}        234        0.27        9.63
{txt}        362 {c |}{res}          1        0.00        9.63
{txt}        363 {c |}{res}          1        0.00        9.63
{txt}        364 {c |}{res}          1        0.00        9.63
{txt}        365 {c |}{res}          2        0.00        9.63
{txt}        367 {c |}{res}          3        0.00        9.64
{txt}        368 {c |}{res}          6        0.01        9.64
{txt}        369 {c |}{res}          1        0.00        9.64
{txt}        370 {c |}{res}         16        0.02        9.66
{txt}        372 {c |}{res}          3        0.00        9.67
{txt}        374 {c |}{res}          1        0.00        9.67
{txt}        375 {c |}{res}         13        0.01        9.68
{txt}        377 {c |}{res}          1        0.00        9.68
{txt}        379 {c |}{res}          8        0.01        9.69
{txt}        380 {c |}{res}         38        0.04        9.74
{txt}        384 {c |}{res}          3        0.00        9.74
{txt}        385 {c |}{res}          2        0.00        9.74
{txt}        386 {c |}{res}          1        0.00        9.74
{txt}        389 {c |}{res}          1        0.00        9.74
{txt}        390 {c |}{res}         22        0.03        9.77
{txt}        392 {c |}{res}          1        0.00        9.77
{txt}        393 {c |}{res}          1        0.00        9.77
{txt}        396 {c |}{res}          2        0.00        9.77
{txt}        399 {c |}{res}          2        0.00        9.78
{txt}        400 {c |}{res}        407        0.47       10.25
{txt}        402 {c |}{res}          6        0.01       10.25
{txt}        405 {c |}{res}          1        0.00       10.25
{txt}        406 {c |}{res}          1        0.00       10.26
{txt}        408 {c |}{res}          1        0.00       10.26
{txt}        410 {c |}{res}          6        0.01       10.26
{txt}        414 {c |}{res}          1        0.00       10.26
{txt}        415 {c |}{res}          1        0.00       10.27
{txt}        416 {c |}{res}          1        0.00       10.27
{txt}        417 {c |}{res}          1        0.00       10.27
{txt}        420 {c |}{res}        142        0.16       10.43
{txt}        424 {c |}{res}          1        0.00       10.43
{txt}        425 {c |}{res}          6        0.01       10.44
{txt}        426 {c |}{res}          1        0.00       10.44
{txt}        428 {c |}{res}          1        0.00       10.44
{txt}        429 {c |}{res}          1        0.00       10.44
{txt}        430 {c |}{res}          9        0.01       10.45
{txt}        433 {c |}{res}          2        0.00       10.46
{txt}        435 {c |}{res}          1        0.00       10.46
{txt}        437 {c |}{res}          3        0.00       10.46
{txt}        440 {c |}{res}          7        0.01       10.47
{txt}        444 {c |}{res}          1        0.00       10.47
{txt}        446 {c |}{res}          1        0.00       10.47
{txt}        448 {c |}{res}          1        0.00       10.47
{txt}        450 {c |}{res}        210        0.24       10.71
{txt}        452 {c |}{res}          3        0.00       10.72
{txt}        453 {c |}{res}          1        0.00       10.72
{txt}        455 {c |}{res}          5        0.01       10.72
{txt}        459 {c |}{res}          2        0.00       10.73
{txt}        460 {c |}{res}         48        0.06       10.78
{txt}        462 {c |}{res}          1        0.00       10.78
{txt}        465 {c |}{res}         29        0.03       10.82
{txt}        468 {c |}{res}         12        0.01       10.83
{txt}        470 {c |}{res}          9        0.01       10.84
{txt}        472 {c |}{res}          2        0.00       10.84
{txt}        475 {c |}{res}          9        0.01       10.85
{txt}        480 {c |}{res}        159        0.18       11.04
{txt}        482 {c |}{res}          1        0.00       11.04
{txt}        485 {c |}{res}          1        0.00       11.04
{txt}        490 {c |}{res}         17        0.02       11.06
{txt}        492 {c |}{res}          1        0.00       11.06
{txt}        495 {c |}{res}          3        0.00       11.06
{txt}        498 {c |}{res}          2        0.00       11.06
{txt}        500 {c |}{res}        497        0.57       11.64
{txt}        504 {c |}{res}          2        0.00       11.64
{txt}        506 {c |}{res}          1        0.00       11.64
{txt}        507 {c |}{res}          2        0.00       11.64
{txt}        508 {c |}{res}          1        0.00       11.64
{txt}        510 {c |}{res}         14        0.02       11.66
{txt}        515 {c |}{res}          2        0.00       11.66
{txt}        517 {c |}{res}          2        0.00       11.67
{txt}        518 {c |}{res}          1        0.00       11.67
{txt}        519 {c |}{res}          1        0.00       11.67
{txt}        520 {c |}{res}         23        0.03       11.69
{txt}        524 {c |}{res}          1        0.00       11.70
{txt}        525 {c |}{res}          9        0.01       11.71
{txt}        528 {c |}{res}          4        0.00       11.71
{txt}        530 {c |}{res}          8        0.01       11.72
{txt}        534 {c |}{res}          1        0.00       11.72
{txt}        537 {c |}{res}          1        0.00       11.72
{txt}        540 {c |}{res}         37        0.04       11.76
{txt}        541 {c |}{res}          1        0.00       11.77
{txt}        543 {c |}{res}          1        0.00       11.77
{txt}        545 {c |}{res}          2        0.00       11.77
{txt}        546 {c |}{res}          3        0.00       11.77
{txt}        550 {c |}{res}         58        0.07       11.84
{txt}        551 {c |}{res}          1        0.00       11.84
{txt}        552 {c |}{res}          1        0.00       11.84
{txt}        555 {c |}{res}          1        0.00       11.84
{txt}        558 {c |}{res}          1        0.00       11.84
{txt}        560 {c |}{res}         26        0.03       11.87
{txt}        561 {c |}{res}          1        0.00       11.87
{txt}        565 {c |}{res}          2        0.00       11.88
{txt}        570 {c |}{res}          8        0.01       11.89
{txt}        574 {c |}{res}          2        0.00       11.89
{txt}        575 {c |}{res}         11        0.01       11.90
{txt}        578 {c |}{res}          1        0.00       11.90
{txt}        580 {c |}{res}         16        0.02       11.92
{txt}        582 {c |}{res}          1        0.00       11.92
{txt}        585 {c |}{res}          2        0.00       11.92
{txt}        588 {c |}{res}          1        0.00       11.93
{txt}        589 {c |}{res}          1        0.00       11.93
{txt}        590 {c |}{res}          4        0.00       11.93
{txt}        598 {c |}{res}          1        0.00       11.93
{txt}        600 {c |}{res}        488        0.56       12.49
{txt}        606 {c |}{res}          3        0.00       12.50
{txt}        609 {c |}{res}          1        0.00       12.50
{txt}        610 {c |}{res}          2        0.00       12.50
{txt}        612 {c |}{res}          1        0.00       12.50
{txt}        613 {c |}{res}          1        0.00       12.50
{txt}        619 {c |}{res}          1        0.00       12.50
{txt}        620 {c |}{res}         10        0.01       12.52
{txt}        622 {c |}{res}          2        0.00       12.52
{txt}        625 {c |}{res}          2        0.00       12.52
{txt}        630 {c |}{res}         11        0.01       12.53
{txt}        632 {c |}{res}          3        0.00       12.54
{txt}        634 {c |}{res}          1        0.00       12.54
{txt}        636 {c |}{res}          1        0.00       12.54
{txt}        638 {c |}{res}          1        0.00       12.54
{txt}        640 {c |}{res}         10        0.01       12.55
{txt}        643 {c |}{res}          1        0.00       12.55
{txt}        645 {c |}{res}          2        0.00       12.56
{txt}        648 {c |}{res}          2        0.00       12.56
{txt}        650 {c |}{res}         68        0.08       12.64
{txt}        654 {c |}{res}          1        0.00       12.64
{txt}        660 {c |}{res}         10        0.01       12.65
{txt}        661 {c |}{res}          1        0.00       12.65
{txt}        662 {c |}{res}          1        0.00       12.65
{txt}        663 {c |}{res}          1        0.00       12.65
{txt}        665 {c |}{res}          2        0.00       12.65
{txt}        667 {c |}{res}          2        0.00       12.66
{txt}        670 {c |}{res}          5        0.01       12.66
{txt}        672 {c |}{res}          1        0.00       12.66
{txt}        675 {c |}{res}          5        0.01       12.67
{txt}        678 {c |}{res}          2        0.00       12.67
{txt}        680 {c |}{res}         12        0.01       12.69
{txt}        683 {c |}{res}          2        0.00       12.69
{txt}        687 {c |}{res}          1        0.00       12.69
{txt}        689 {c |}{res}          3        0.00       12.69
{txt}        690 {c |}{res}         12        0.01       12.71
{txt}        692 {c |}{res}          1        0.00       12.71
{txt}        693 {c |}{res}          3        0.00       12.71
{txt}        699 {c |}{res}          1        0.00       12.71
{txt}        700 {c |}{res}        269        0.31       13.02
{txt}        702 {c |}{res}          3        0.00       13.03
{txt}        704 {c |}{res}          2        0.00       13.03
{txt}        705 {c |}{res}          1        0.00       13.03
{txt}        707 {c |}{res}          1        0.00       13.03
{txt}        710 {c |}{res}          4        0.00       13.03
{txt}        713 {c |}{res}          2        0.00       13.04
{txt}        716 {c |}{res}          1        0.00       13.04
{txt}        720 {c |}{res}         45        0.05       13.09
{txt}        724 {c |}{res}          2        0.00       13.09
{txt}        725 {c |}{res}          1        0.00       13.09
{txt}        727 {c |}{res}          1        0.00       13.09
{txt}        730 {c |}{res}          9        0.01       13.11
{txt}        732 {c |}{res}          1        0.00       13.11
{txt}        737 {c |}{res}          1        0.00       13.11
{txt}        740 {c |}{res}          6        0.01       13.11
{txt}        742 {c |}{res}          1        0.00       13.12
{txt}        747 {c |}{res}          1        0.00       13.12
{txt}        750 {c |}{res}        116        0.13       13.25
{txt}        752 {c |}{res}          1        0.00       13.25
{txt}        754 {c |}{res}          1        0.00       13.25
{txt}        756 {c |}{res}          2        0.00       13.25
{txt}        757 {c |}{res}          1        0.00       13.26
{txt}        758 {c |}{res}          4        0.00       13.26
{txt}        759 {c |}{res}          1        0.00       13.26
{txt}        760 {c |}{res}         10        0.01       13.27
{txt}        765 {c |}{res}          1        0.00       13.27
{txt}        766 {c |}{res}          1        0.00       13.28
{txt}        767 {c |}{res}          3        0.00       13.28
{txt}        770 {c |}{res}         10        0.01       13.29
{txt}        774 {c |}{res}          1        0.00       13.29
{txt}        778 {c |}{res}          1        0.00       13.29
{txt}        779 {c |}{res}          3        0.00       13.30
{txt}        780 {c |}{res}         34        0.04       13.34
{txt}        782 {c |}{res}          1        0.00       13.34
{txt}        785 {c |}{res}          1        0.00       13.34
{txt}        790 {c |}{res}          3        0.00       13.34
{txt}        798 {c |}{res}          1        0.00       13.34
{txt}        800 {c |}{res}        328        0.38       13.72
{txt}        804 {c |}{res}          1        0.00       13.72
{txt}        805 {c |}{res}          5        0.01       13.73
{txt}        810 {c |}{res}          4        0.00       13.73
{txt}        815 {c |}{res}          1        0.00       13.73
{txt}        819 {c |}{res}         19        0.02       13.75
{txt}        820 {c |}{res}          9        0.01       13.77
{txt}        821 {c |}{res}          1        0.00       13.77
{txt}        822 {c |}{res}          1        0.00       13.77
{txt}        827 {c |}{res}          2        0.00       13.77
{txt}        829 {c |}{res}          1        0.00       13.77
{txt}        830 {c |}{res}          5        0.01       13.78
{txt}        831 {c |}{res}          1        0.00       13.78
{txt}        834 {c |}{res}          1        0.00       13.78
{txt}        835 {c |}{res}          1        0.00       13.78
{txt}        840 {c |}{res}         26        0.03       13.81
{txt}        844 {c |}{res}          2        0.00       13.81
{txt}        845 {c |}{res}          2        0.00       13.81
{txt}        850 {c |}{res}         94        0.11       13.92
{txt}        852 {c |}{res}          1        0.00       13.92
{txt}        858 {c |}{res}          4        0.00       13.93
{txt}        860 {c |}{res}          5        0.01       13.93
{txt}        862 {c |}{res}          5        0.01       13.94
{txt}        866 {c |}{res}          3        0.00       13.94
{txt}        870 {c |}{res}          2        0.00       13.95
{txt}        875 {c |}{res}          6        0.01       13.95
{txt}        880 {c |}{res}         12        0.01       13.97
{txt}        885 {c |}{res}          2        0.00       13.97
{txt}        890 {c |}{res}          2        0.00       13.97
{txt}        892 {c |}{res}          1        0.00       13.97
{txt}        895 {c |}{res}          1        0.00       13.97
{txt}        896 {c |}{res}          1        0.00       13.97
{txt}        897 {c |}{res}          2        0.00       13.98
{txt}        900 {c |}{res}        254        0.29       14.27
{txt}        902 {c |}{res}          1        0.00       14.27
{txt}        903 {c |}{res}          1        0.00       14.27
{txt}        905 {c |}{res}          1        0.00       14.27
{txt}        908 {c |}{res}          1        0.00       14.27
{txt}        909 {c |}{res}          4        0.00       14.28
{txt}        915 {c |}{res}          1        0.00       14.28
{txt}        919 {c |}{res}          1        0.00       14.28
{txt}        920 {c |}{res}         19        0.02       14.30
{txt}        925 {c |}{res}          1        0.00       14.30
{txt}        930 {c |}{res}      1,010        1.16       15.47
{txt}        931 {c |}{res}          1        0.00       15.47
{txt}        932 {c |}{res}          1        0.00       15.47
{txt}        933 {c |}{res}          2        0.00       15.47
{txt}        934 {c |}{res}          1        0.00       15.47
{txt}        935 {c |}{res}          7        0.01       15.48
{txt}        936 {c |}{res}          2        0.00       15.48
{txt}        938 {c |}{res}          1        0.00       15.49
{txt}        940 {c |}{res}          2        0.00       15.49
{txt}        943 {c |}{res}          1        0.00       15.49
{txt}        945 {c |}{res}          1        0.00       15.49
{txt}        948 {c |}{res}          1        0.00       15.49
{txt}        950 {c |}{res}        259        0.30       15.79
{txt}        954 {c |}{res}          1        0.00       15.79
{txt}        958 {c |}{res}          3        0.00       15.79
{txt}        960 {c |}{res}         68        0.08       15.87
{txt}        961 {c |}{res}          1        0.00       15.87
{txt}        966 {c |}{res}          1        0.00       15.87
{txt}        968 {c |}{res}          1        0.00       15.88
{txt}        970 {c |}{res}          9        0.01       15.89
{txt}        975 {c |}{res}          4        0.00       15.89
{txt}        977 {c |}{res}          1        0.00       15.89
{txt}        980 {c |}{res}         31        0.04       15.93
{txt}        982 {c |}{res}          1        0.00       15.93
{txt}        987 {c |}{res}          1        0.00       15.93
{txt}        990 {c |}{res}          5        0.01       15.94
{txt}        992 {c |}{res}          1        0.00       15.94
{txt}        995 {c |}{res}          1        0.00       15.94
{txt}        996 {c |}{res}          1        0.00       15.94
{txt}       1000 {c |}{res}        625        0.72       16.66
{txt}       1003 {c |}{res}          1        0.00       16.66
{txt}       1005 {c |}{res}          1        0.00       16.66
{txt}       1007 {c |}{res}          1        0.00       16.66
{txt}       1010 {c |}{res}          2        0.00       16.66
{txt}       1011 {c |}{res}          1        0.00       16.67
{txt}       1013 {c |}{res}          4        0.00       16.67
{txt}       1014 {c |}{res}          1        0.00       16.67
{txt}       1016 {c |}{res}          1        0.00       16.67
{txt}       1017 {c |}{res}          8        0.01       16.68
{txt}       1020 {c |}{res}         12        0.01       16.70
{txt}       1023 {c |}{res}          9        0.01       16.71
{txt}       1025 {c |}{res}          1        0.00       16.71
{txt}       1026 {c |}{res}          1        0.00       16.71
{txt}       1027 {c |}{res}          1        0.00       16.71
{txt}       1030 {c |}{res}         13        0.01       16.72
{txt}       1034 {c |}{res}          7        0.01       16.73
{txt}       1035 {c |}{res}          4        0.00       16.74
{txt}       1036 {c |}{res}          1        0.00       16.74
{txt}       1039 {c |}{res}          6        0.01       16.75
{txt}       1040 {c |}{res}         11        0.01       16.76
{txt}       1045 {c |}{res}          1        0.00       16.76
{txt}       1050 {c |}{res}         78        0.09       16.85
{txt}       1051 {c |}{res}          7        0.01       16.86
{txt}       1055 {c |}{res}          1        0.00       16.86
{txt}       1056 {c |}{res}          1        0.00       16.86
{txt}       1057 {c |}{res}          1        0.00       16.86
{txt}       1060 {c |}{res}          7        0.01       16.87
{txt}       1067 {c |}{res}          1        0.00       16.87
{txt}       1068 {c |}{res}          5        0.01       16.88
{txt}       1069 {c |}{res}         14        0.02       16.89
{txt}       1070 {c |}{res}          9        0.01       16.90
{txt}       1071 {c |}{res}          1        0.00       16.90
{txt}       1073 {c |}{res}          2        0.00       16.91
{txt}       1074 {c |}{res}          4        0.00       16.91
{txt}       1075 {c |}{res}          3        0.00       16.91
{txt}       1080 {c |}{res}         22        0.03       16.94
{txt}       1087 {c |}{res}          1        0.00       16.94
{txt}       1090 {c |}{res}          4        0.00       16.94
{txt}       1092 {c |}{res}          3        0.00       16.95
{txt}       1095 {c |}{res}          1        0.00       16.95
{txt}       1096 {c |}{res}          1        0.00       16.95
{txt}       1099 {c |}{res}          1        0.00       16.95
{txt}       1100 {c |}{res}        213        0.25       17.20
{txt}       1102 {c |}{res}          1        0.00       17.20
{txt}       1105 {c |}{res}          1        0.00       17.20
{txt}       1106 {c |}{res}          1        0.00       17.20
{txt}       1108 {c |}{res}          2        0.00       17.20
{txt}       1110 {c |}{res}          1        0.00       17.20
{txt}       1119 {c |}{res}          1        0.00       17.21
{txt}       1120 {c |}{res}         13        0.01       17.22
{txt}       1121 {c |}{res}          2        0.00       17.22
{txt}       1122 {c |}{res}          2        0.00       17.22
{txt}       1123 {c |}{res}          2        0.00       17.23
{txt}       1130 {c |}{res}         14        0.02       17.24
{txt}       1131 {c |}{res}          1        0.00       17.24
{txt}       1136 {c |}{res}          1        0.00       17.25
{txt}       1137 {c |}{res}          1        0.00       17.25
{txt}       1138 {c |}{res}          1        0.00       17.25
{txt}       1140 {c |}{res}          6        0.01       17.25
{txt}       1143 {c |}{res}          1        0.00       17.26
{txt}       1149 {c |}{res}          3        0.00       17.26
{txt}       1150 {c |}{res}         40        0.05       17.31
{txt}       1155 {c |}{res}          3        0.00       17.31
{txt}       1156 {c |}{res}          1        0.00       17.31
{txt}       1160 {c |}{res}          6        0.01       17.32
{txt}       1165 {c |}{res}          1        0.00       17.32
{txt}       1168 {c |}{res}          1        0.00       17.32
{txt}       1169 {c |}{res}          1        0.00       17.32
{txt}       1170 {c |}{res}          9        0.01       17.33
{txt}       1175 {c |}{res}          1        0.00       17.33
{txt}       1178 {c |}{res}          2        0.00       17.33
{txt}       1180 {c |}{res}          5        0.01       17.34
{txt}       1186 {c |}{res}          1        0.00       17.34
{txt}       1189 {c |}{res}          1        0.00       17.34
{txt}       1200 {c |}{res}        911        1.05       18.39
{txt}       1201 {c |}{res}          1        0.00       18.39
{txt}       1202 {c |}{res}          1        0.00       18.39
{txt}       1206 {c |}{res}          1        0.00       18.40
{txt}       1207 {c |}{res}          1        0.00       18.40
{txt}       1208 {c |}{res}          1        0.00       18.40
{txt}       1210 {c |}{res}          2        0.00       18.40
{txt}       1212 {c |}{res}          1        0.00       18.40
{txt}       1214 {c |}{res}          1        0.00       18.40
{txt}       1216 {c |}{res}          1        0.00       18.40
{txt}       1220 {c |}{res}          1        0.00       18.40
{txt}       1225 {c |}{res}          2        0.00       18.41
{txt}       1230 {c |}{res}          7        0.01       18.41
{txt}       1232 {c |}{res}          1        0.00       18.42
{txt}       1235 {c |}{res}          1        0.00       18.42
{txt}       1240 {c |}{res}          5        0.01       18.42
{txt}       1241 {c |}{res}          1        0.00       18.42
{txt}       1243 {c |}{res}          1        0.00       18.42
{txt}       1245 {c |}{res}          1        0.00       18.43
{txt}       1248 {c |}{res}          5        0.01       18.43
{txt}       1250 {c |}{res}         57        0.07       18.50
{txt}       1254 {c |}{res}          1        0.00       18.50
{txt}       1260 {c |}{res}          6        0.01       18.51
{txt}       1264 {c |}{res}          6        0.01       18.51
{txt}       1265 {c |}{res}          1        0.00       18.51
{txt}       1270 {c |}{res}          1        0.00       18.51
{txt}       1272 {c |}{res}          1        0.00       18.52
{txt}       1276 {c |}{res}          1        0.00       18.52
{txt}       1280 {c |}{res}          7        0.01       18.53
{txt}       1287 {c |}{res}          1        0.00       18.53
{txt}       1288 {c |}{res}          1        0.00       18.53
{txt}       1290 {c |}{res}          2        0.00       18.53
{txt}       1299 {c |}{res}          4        0.00       18.53
{txt}       1300 {c |}{res}        289        0.33       18.87
{txt}       1305 {c |}{res}          1        0.00       18.87
{txt}       1320 {c |}{res}          4        0.00       18.87
{txt}       1322 {c |}{res}          1        0.00       18.87
{txt}       1325 {c |}{res}          2        0.00       18.88
{txt}       1327 {c |}{res}          1        0.00       18.88
{txt}       1330 {c |}{res}          5        0.01       18.88
{txt}       1333 {c |}{res}          1        0.00       18.88
{txt}       1340 {c |}{res}          1        0.00       18.89
{txt}       1343 {c |}{res}          1        0.00       18.89
{txt}       1344 {c |}{res}          1        0.00       18.89
{txt}       1350 {c |}{res}         47        0.05       18.94
{txt}       1356 {c |}{res}         13        0.01       18.96
{txt}       1358 {c |}{res}          1        0.00       18.96
{txt}       1359 {c |}{res}          1        0.00       18.96
{txt}       1360 {c |}{res}          4        0.00       18.96
{txt}       1365 {c |}{res}          2        0.00       18.97
{txt}       1366 {c |}{res}          1        0.00       18.97
{txt}       1370 {c |}{res}          4        0.00       18.97
{txt}       1377 {c |}{res}          2        0.00       18.97
{txt}       1379 {c |}{res}         11        0.01       18.99
{txt}       1380 {c |}{res}         13        0.01       19.00
{txt}       1386 {c |}{res}          1        0.00       19.00
{txt}       1390 {c |}{res}          1        0.00       19.00
{txt}       1392 {c |}{res}          1        0.00       19.01
{txt}       1395 {c |}{res}          1        0.00       19.01
{txt}       1397 {c |}{res}          2        0.00       19.01
{txt}       1400 {c |}{res}        224        0.26       19.27
{txt}       1410 {c |}{res}          1        0.00       19.27
{txt}       1412 {c |}{res}          1        0.00       19.27
{txt}       1413 {c |}{res}          1        0.00       19.27
{txt}       1416 {c |}{res}          1        0.00       19.27
{txt}       1420 {c |}{res}          3        0.00       19.28
{txt}       1423 {c |}{res}          1        0.00       19.28
{txt}       1424 {c |}{res}          2        0.00       19.28
{txt}       1430 {c |}{res}          9        0.01       19.29
{txt}       1436 {c |}{res}          1        0.00       19.29
{txt}       1440 {c |}{res}         16        0.02       19.31
{txt}       1445 {c |}{res}          1        0.00       19.31
{txt}       1446 {c |}{res}          1        0.00       19.31
{txt}       1449 {c |}{res}          1        0.00       19.31
{txt}       1450 {c |}{res}         20        0.02       19.34
{txt}       1454 {c |}{res}          1        0.00       19.34
{txt}       1456 {c |}{res}          2        0.00       19.34
{txt}       1457 {c |}{res}          1        0.00       19.34
{txt}       1460 {c |}{res}          3        0.00       19.34
{txt}       1469 {c |}{res}          3        0.00       19.35
{txt}       1470 {c |}{res}          7        0.01       19.35
{txt}       1477 {c |}{res}          1        0.00       19.36
{txt}       1478 {c |}{res}          1        0.00       19.36
{txt}       1480 {c |}{res}          5        0.01       19.36
{txt}       1481 {c |}{res}          1        0.00       19.36
{txt}       1483 {c |}{res}          1        0.00       19.37
{txt}       1485 {c |}{res}          2        0.00       19.37
{txt}       1490 {c |}{res}          1        0.00       19.37
{txt}       1494 {c |}{res}          3        0.00       19.37
{txt}       1495 {c |}{res}          1        0.00       19.37
{txt}       1500 {c |}{res}        835        0.96       20.33
{txt}       1516 {c |}{res}          2        0.00       20.34
{txt}       1520 {c |}{res}          7        0.01       20.35
{txt}       1525 {c |}{res}          1        0.00       20.35
{txt}       1526 {c |}{res}          1        0.00       20.35
{txt}       1530 {c |}{res}          2        0.00       20.35
{txt}       1536 {c |}{res}          2        0.00       20.35
{txt}       1540 {c |}{res}          2        0.00       20.35
{txt}       1543 {c |}{res}          1        0.00       20.36
{txt}       1545 {c |}{res}          1        0.00       20.36
{txt}       1550 {c |}{res}         17        0.02       20.38
{txt}       1558 {c |}{res}          1        0.00       20.38
{txt}       1559 {c |}{res}          3        0.00       20.38
{txt}       1560 {c |}{res}          7        0.01       20.39
{txt}       1562 {c |}{res}          1        0.00       20.39
{txt}       1564 {c |}{res}          1        0.00       20.39
{txt}       1566 {c |}{res}          1        0.00       20.39
{txt}       1568 {c |}{res}          1        0.00       20.39
{txt}       1570 {c |}{res}          2        0.00       20.40
{txt}       1580 {c |}{res}          4        0.00       20.40
{txt}       1582 {c |}{res}          5        0.01       20.41
{txt}       1595 {c |}{res}          2        0.00       20.41
{txt}       1596 {c |}{res}          1        0.00       20.41
{txt}       1600 {c |}{res}        190        0.22       20.63
{txt}       1609 {c |}{res}          4        0.00       20.63
{txt}       1610 {c |}{res}          3        0.00       20.64
{txt}       1620 {c |}{res}          6        0.01       20.64
{txt}       1630 {c |}{res}          3        0.00       20.65
{txt}       1637 {c |}{res}          1        0.00       20.65
{txt}       1639 {c |}{res}          1        0.00       20.65
{txt}       1640 {c |}{res}          2        0.00       20.65
{txt}       1642 {c |}{res}          1        0.00       20.65
{txt}       1643 {c |}{res}          1        0.00       20.65
{txt}       1644 {c |}{res}          1        0.00       20.66
{txt}       1645 {c |}{res}          1        0.00       20.66
{txt}       1650 {c |}{res}         23        0.03       20.68
{txt}       1655 {c |}{res}          4        0.00       20.69
{txt}       1660 {c |}{res}          2        0.00       20.69
{txt}       1666 {c |}{res}          1        0.00       20.69
{txt}       1667 {c |}{res}          2        0.00       20.69
{txt}       1675 {c |}{res}          1        0.00       20.69
{txt}       1677 {c |}{res}          1        0.00       20.70
{txt}       1680 {c |}{res}          9        0.01       20.71
{txt}       1684 {c |}{res}          1        0.00       20.71
{txt}       1688 {c |}{res}          1        0.00       20.71
{txt}       1690 {c |}{res}          1        0.00       20.71
{txt}       1692 {c |}{res}          1        0.00       20.71
{txt}       1695 {c |}{res}          9        0.01       20.72
{txt}       1700 {c |}{res}        176        0.20       20.92
{txt}       1703 {c |}{res}          1        0.00       20.92
{txt}       1708 {c |}{res}          1        0.00       20.93
{txt}       1720 {c |}{res}          5        0.01       20.93
{txt}       1724 {c |}{res}         14        0.02       20.95
{txt}       1725 {c |}{res}          1        0.00       20.95
{txt}       1730 {c |}{res}          4        0.00       20.95
{txt}       1740 {c |}{res}          4        0.00       20.96
{txt}       1742 {c |}{res}          1        0.00       20.96
{txt}       1745 {c |}{res}          2        0.00       20.96
{txt}       1750 {c |}{res}         19        0.02       20.98
{txt}       1755 {c |}{res}          1        0.00       20.98
{txt}       1760 {c |}{res}          2        0.00       20.99
{txt}       1763 {c |}{res}          1        0.00       20.99
{txt}       1768 {c |}{res}          1        0.00       20.99
{txt}       1770 {c |}{res}          1        0.00       20.99
{txt}       1780 {c |}{res}          1        0.00       20.99
{txt}       1790 {c |}{res}          1        0.00       20.99
{txt}       1793 {c |}{res}          1        0.00       20.99
{txt}       1795 {c |}{res}          1        0.00       21.00
{txt}       1800 {c |}{res}        384        0.44       21.44
{txt}       1806 {c |}{res}          1        0.00       21.44
{txt}       1808 {c |}{res}          5        0.01       21.44
{txt}       1810 {c |}{res}          1        0.00       21.45
{txt}       1813 {c |}{res}          1        0.00       21.45
{txt}       1820 {c |}{res}          5        0.01       21.45
{txt}       1821 {c |}{res}          2        0.00       21.45
{txt}       1827 {c |}{res}          1        0.00       21.46
{txt}       1828 {c |}{res}          1        0.00       21.46
{txt}       1830 {c |}{res}          3        0.00       21.46
{txt}       1839 {c |}{res}          6        0.01       21.47
{txt}       1840 {c |}{res}          3        0.00       21.47
{txt}       1843 {c |}{res}          1        0.00       21.47
{txt}       1850 {c |}{res}         16        0.02       21.49
{txt}       1860 {c |}{res}          2        0.00       21.49
{txt}       1880 {c |}{res}          1        0.00       21.49
{txt}       1888 {c |}{res}          1        0.00       21.50
{txt}       1890 {c |}{res}          3        0.00       21.50
{txt}       1900 {c |}{res}         75        0.09       21.58
{txt}       1904 {c |}{res}          1        0.00       21.59
{txt}       1910 {c |}{res}          1        0.00       21.59
{txt}       1911 {c |}{res}          1        0.00       21.59
{txt}       1920 {c |}{res}          3        0.00       21.59
{txt}       1924 {c |}{res}          1        0.00       21.59
{txt}       1925 {c |}{res}          1        0.00       21.59
{txt}       1926 {c |}{res}          1        0.00       21.60
{txt}       1930 {c |}{res}          1        0.00       21.60
{txt}       1931 {c |}{res}          1        0.00       21.60
{txt}       1936 {c |}{res}          2        0.00       21.60
{txt}       1940 {c |}{res}          1        0.00       21.60
{txt}       1944 {c |}{res}          1        0.00       21.60
{txt}       1950 {c |}{res}          6        0.01       21.61
{txt}       1954 {c |}{res}          4        0.00       21.61
{txt}       1958 {c |}{res}          1        0.00       21.61
{txt}       1963 {c |}{res}          1        0.00       21.62
{txt}       1970 {c |}{res}          2        0.00       21.62
{txt}       1971 {c |}{res}          1        0.00       21.62
{txt}       1976 {c |}{res}          1        0.00       21.62
{txt}       1977 {c |}{res}          1        0.00       21.62
{txt}       1978 {c |}{res}          1        0.00       21.62
{txt}       1980 {c |}{res}          5        0.01       21.63
{txt}       1985 {c |}{res}          2        0.00       21.63
{txt}       1990 {c |}{res}          2        0.00       21.63
{txt}       1998 {c |}{res}          2        0.00       21.64
{txt}       2000 {c |}{res}        582        0.67       22.31
{txt}       2007 {c |}{res}          1        0.00       22.31
{txt}       2010 {c |}{res}          2        0.00       22.31
{txt}       2015 {c |}{res}          1        0.00       22.31
{txt}       2016 {c |}{res}          1        0.00       22.31
{txt}       2020 {c |}{res}          4        0.00       22.32
{txt}       2025 {c |}{res}          2        0.00       22.32
{txt}       2034 {c |}{res}          2        0.00       22.32
{txt}       2035 {c |}{res}          1        0.00       22.32
{txt}       2039 {c |}{res}          1        0.00       22.32
{txt}       2043 {c |}{res}          1        0.00       22.32
{txt}       2046 {c |}{res}          1        0.00       22.33
{txt}       2048 {c |}{res}          1        0.00       22.33
{txt}       2050 {c |}{res}          5        0.01       22.33
{txt}       2060 {c |}{res}          1        0.00       22.33
{txt}       2066 {c |}{res}          1        0.00       22.33
{txt}       2068 {c |}{res}          2        0.00       22.34
{txt}       2069 {c |}{res}          4        0.00       22.34
{txt}       2070 {c |}{res}          1        0.00       22.34
{txt}       2078 {c |}{res}          1        0.00       22.34
{txt}       2080 {c |}{res}          5        0.01       22.35
{txt}       2085 {c |}{res}          1        0.00       22.35
{txt}       2088 {c |}{res}          1        0.00       22.35
{txt}       2090 {c |}{res}          1        0.00       22.35
{txt}       2094 {c |}{res}          1        0.00       22.35
{txt}       2097 {c |}{res}          1        0.00       22.36
{txt}       2099 {c |}{res}          1        0.00       22.36
{txt}       2100 {c |}{res}        103        0.12       22.48
{txt}       2103 {c |}{res}          1        0.00       22.48
{txt}       2110 {c |}{res}          1        0.00       22.48
{txt}       2120 {c |}{res}          2        0.00       22.48
{txt}       2130 {c |}{res}          4        0.00       22.48
{txt}       2145 {c |}{res}          1        0.00       22.49
{txt}       2150 {c |}{res}         10        0.01       22.50
{txt}       2159 {c |}{res}          1        0.00       22.50
{txt}       2160 {c |}{res}          6        0.01       22.51
{txt}       2163 {c |}{res}          1        0.00       22.51
{txt}       2165 {c |}{res}          2        0.00       22.51
{txt}       2170 {c |}{res}          2        0.00       22.51
{txt}       2172 {c |}{res}          1        0.00       22.51
{txt}       2176 {c |}{res}          1        0.00       22.51
{txt}       2180 {c |}{res}          4        0.00       22.52
{txt}       2183 {c |}{res}          2        0.00       22.52
{txt}       2190 {c |}{res}          1        0.00       22.52
{txt}       2192 {c |}{res}          1        0.00       22.52
{txt}       2198 {c |}{res}          1        0.00       22.52
{txt}       2200 {c |}{res}        274        0.32       22.84
{txt}       2208 {c |}{res}          2        0.00       22.84
{txt}       2213 {c |}{res}          1        0.00       22.84
{txt}       2220 {c |}{res}          4        0.00       22.85
{txt}       2228 {c |}{res}          1        0.00       22.85
{txt}       2230 {c |}{res}          2        0.00       22.85
{txt}       2232 {c |}{res}          1        0.00       22.85
{txt}       2240 {c |}{res}          5        0.01       22.86
{txt}       2245 {c |}{res}          1        0.00       22.86
{txt}       2250 {c |}{res}         10        0.01       22.87
{txt}       2253 {c |}{res}          1        0.00       22.87
{txt}       2260 {c |}{res}          6        0.01       22.88
{txt}       2264 {c |}{res}          1        0.00       22.88
{txt}       2267 {c |}{res}          1        0.00       22.88
{txt}       2270 {c |}{res}          2        0.00       22.88
{txt}       2273 {c |}{res}          1        0.00       22.88
{txt}       2280 {c |}{res}          2        0.00       22.89
{txt}       2284 {c |}{res}          1        0.00       22.89
{txt}       2288 {c |}{res}          1        0.00       22.89
{txt}       2297 {c |}{res}          1        0.00       22.89
{txt}       2298 {c |}{res}          6        0.01       22.90
{txt}       2299 {c |}{res}          8        0.01       22.91
{txt}       2300 {c |}{res}        191        0.22       23.13
{txt}       2302 {c |}{res}          1        0.00       23.13
{txt}       2310 {c |}{res}          1        0.00       23.13
{txt}       2320 {c |}{res}          5        0.01       23.13
{txt}       2338 {c |}{res}          1        0.00       23.14
{txt}       2340 {c |}{res}          1        0.00       23.14
{txt}       2344 {c |}{res}          1        0.00       23.14
{txt}       2350 {c |}{res}          7        0.01       23.15
{txt}       2360 {c |}{res}          2        0.00       23.15
{txt}       2370 {c |}{res}          1        0.00       23.15
{txt}       2373 {c |}{res}          1        0.00       23.15
{txt}       2374 {c |}{res}          1        0.00       23.15
{txt}       2380 {c |}{res}          3        0.00       23.16
{txt}       2390 {c |}{res}          2        0.00       23.16
{txt}       2396 {c |}{res}          1        0.00       23.16
{txt}       2397 {c |}{res}          1        0.00       23.16
{txt}       2400 {c |}{res}        253        0.29       23.45
{txt}       2410 {c |}{res}          1        0.00       23.45
{txt}       2413 {c |}{res}          1        0.00       23.45
{txt}       2414 {c |}{res}          3        0.00       23.46
{txt}       2418 {c |}{res}          1        0.00       23.46
{txt}       2420 {c |}{res}          1        0.00       23.46
{txt}       2430 {c |}{res}          1        0.00       23.46
{txt}       2435 {c |}{res}          1        0.00       23.46
{txt}       2440 {c |}{res}          1        0.00       23.46
{txt}       2445 {c |}{res}          1        0.00       23.46
{txt}       2450 {c |}{res}          7        0.01       23.47
{txt}       2460 {c |}{res}          2        0.00       23.47
{txt}       2463 {c |}{res}          1        0.00       23.48
{txt}       2470 {c |}{res}          2        0.00       23.48
{txt}       2478 {c |}{res}          1        0.00       23.48
{txt}       2480 {c |}{res}          3        0.00       23.48
{txt}       2481 {c |}{res}          1        0.00       23.48
{txt}       2486 {c |}{res}          4        0.00       23.49
{txt}       2487 {c |}{res}          1        0.00       23.49
{txt}       2500 {c |}{res}        536        0.62       24.11
{txt}       2510 {c |}{res}          1        0.00       24.11
{txt}       2512 {c |}{res}          1        0.00       24.11
{txt}       2514 {c |}{res}          1        0.00       24.11
{txt}       2528 {c |}{res}          5        0.01       24.12
{txt}       2529 {c |}{res}          2        0.00       24.12
{txt}       2530 {c |}{res}          3        0.00       24.12
{txt}       2540 {c |}{res}          1        0.00       24.12
{txt}       2542 {c |}{res}          1        0.00       24.12
{txt}       2550 {c |}{res}          5        0.01       24.13
{txt}       2553 {c |}{res}          1        0.00       24.13
{txt}       2555 {c |}{res}          1        0.00       24.13
{txt}       2560 {c |}{res}          2        0.00       24.13
{txt}       2580 {c |}{res}          4        0.00       24.14
{txt}       2588 {c |}{res}          1        0.00       24.14
{txt}       2598 {c |}{res}          2        0.00       24.14
{txt}       2599 {c |}{res}          1        0.00       24.14
{txt}       2600 {c |}{res}         98        0.11       24.26
{txt}       2610 {c |}{res}          2        0.00       24.26
{txt}       2620 {c |}{res}          2        0.00       24.26
{txt}       2630 {c |}{res}          1        0.00       24.26
{txt}       2640 {c |}{res}          5        0.01       24.27
{txt}       2643 {c |}{res}          4        0.00       24.27
{txt}       2644 {c |}{res}          2        0.00       24.27
{txt}       2645 {c |}{res}          1        0.00       24.28
{txt}       2650 {c |}{res}          2        0.00       24.28
{txt}       2667 {c |}{res}          1        0.00       24.28
{txt}       2677 {c |}{res}          1        0.00       24.28
{txt}       2679 {c |}{res}          1        0.00       24.28
{txt}       2680 {c |}{res}          3        0.00       24.29
{txt}       2700 {c |}{res}         98        0.11       24.40
{txt}       2701 {c |}{res}          1        0.00       24.40
{txt}       2709 {c |}{res}          1        0.00       24.40
{txt}       2710 {c |}{res}          1        0.00       24.40
{txt}       2719 {c |}{res}          1        0.00       24.40
{txt}       2720 {c |}{res}          2        0.00       24.40
{txt}       2725 {c |}{res}          1        0.00       24.41
{txt}       2730 {c |}{res}          1        0.00       24.41
{txt}       2738 {c |}{res}          1        0.00       24.41
{txt}       2740 {c |}{res}          3        0.00       24.41
{txt}       2750 {c |}{res}         12        0.01       24.43
{txt}       2755 {c |}{res}          1        0.00       24.43
{txt}       2758 {c |}{res}          1        0.00       24.43
{txt}       2759 {c |}{res}          1        0.00       24.43
{txt}       2760 {c |}{res}          3        0.00       24.43
{txt}       2775 {c |}{res}          1        0.00       24.43
{txt}       2780 {c |}{res}          2        0.00       24.44
{txt}       2788 {c |}{res}          1        0.00       24.44
{txt}       2790 {c |}{res}          2        0.00       24.44
{txt}       2800 {c |}{res}        201        0.23       24.67
{txt}       2810 {c |}{res}          1        0.00       24.67
{txt}       2815 {c |}{res}          1        0.00       24.67
{txt}       2820 {c |}{res}          1        0.00       24.67
{txt}       2825 {c |}{res}          3        0.00       24.68
{txt}       2836 {c |}{res}          1        0.00       24.68
{txt}       2840 {c |}{res}          1        0.00       24.68
{txt}       2850 {c |}{res}         13        0.01       24.70
{txt}       2860 {c |}{res}          2        0.00       24.70
{txt}       2870 {c |}{res}          1        0.00       24.70
{txt}       2873 {c |}{res}          7        0.01       24.71
{txt}       2874 {c |}{res}          4        0.00       24.71
{txt}       2875 {c |}{res}          2        0.00       24.71
{txt}       2880 {c |}{res}          4        0.00       24.72
{txt}       2888 {c |}{res}          1        0.00       24.72
{txt}       2890 {c |}{res}          2        0.00       24.72
{txt}       2900 {c |}{res}         41        0.05       24.77
{txt}       2930 {c |}{res}          1        0.00       24.77
{txt}       2938 {c |}{res}          1        0.00       24.77
{txt}       2940 {c |}{res}          1        0.00       24.77
{txt}       2950 {c |}{res}          3        0.00       24.78
{txt}       2965 {c |}{res}          1        0.00       24.78
{txt}       2970 {c |}{res}          2        0.00       24.78
{txt}       2972 {c |}{res}          1        0.00       24.78
{txt}       2975 {c |}{res}          1        0.00       24.78
{txt}       2980 {c |}{res}          2        0.00       24.78
{txt}       2983 {c |}{res}          1        0.00       24.79
{txt}       2988 {c |}{res}          2        0.00       24.79
{txt}       2994 {c |}{res}          1        0.00       24.79
{txt}       3000 {c |}{res}        397        0.46       25.25
{txt}       3011 {c |}{res}          1        0.00       25.25
{txt}       3020 {c |}{res}          2        0.00       25.25
{txt}       3024 {c |}{res}          1        0.00       25.25
{txt}       3031 {c |}{res}          1        0.00       25.25
{txt}       3040 {c |}{res}          4        0.00       25.26
{txt}       3050 {c |}{res}          8        0.01       25.27
{txt}       3058 {c |}{res}          1        0.00       25.27
{txt}       3067 {c |}{res}          1        0.00       25.27
{txt}       3070 {c |}{res}          1        0.00       25.27
{txt}       3080 {c |}{res}          1        0.00       25.27
{txt}       3090 {c |}{res}          1        0.00       25.27
{txt}       3097 {c |}{res}          1        0.00       25.27
{txt}       3100 {c |}{res}         36        0.04       25.31
{txt}       3120 {c |}{res}          2        0.00       25.32
{txt}       3122 {c |}{res}          1        0.00       25.32
{txt}       3126 {c |}{res}          1        0.00       25.32
{txt}       3130 {c |}{res}          3        0.00       25.32
{txt}       3150 {c |}{res}          3        0.00       25.33
{txt}       3164 {c |}{res}          1        0.00       25.33
{txt}       3170 {c |}{res}          3        0.00       25.33
{txt}       3174 {c |}{res}          1        0.00       25.33
{txt}       3180 {c |}{res}          1        0.00       25.33
{txt}       3190 {c |}{res}          1        0.00       25.33
{txt}       3196 {c |}{res}          1        0.00       25.33
{txt}       3200 {c |}{res}         96        0.11       25.45
{txt}       3205 {c |}{res}          1        0.00       25.45
{txt}       3210 {c |}{res}          1        0.00       25.45
{txt}       3218 {c |}{res}          4        0.00       25.45
{txt}       3220 {c |}{res}          4        0.00       25.46
{txt}       3230 {c |}{res}          1        0.00       25.46
{txt}       3234 {c |}{res}          1        0.00       25.46
{txt}       3235 {c |}{res}          1        0.00       25.46
{txt}       3243 {c |}{res}          1        0.00       25.46
{txt}       3248 {c |}{res}          1        0.00       25.46
{txt}       3250 {c |}{res}          7        0.01       25.47
{txt}       3260 {c |}{res}          1        0.00       25.47
{txt}       3270 {c |}{res}          1        0.00       25.47
{txt}       3277 {c |}{res}          1        0.00       25.47
{txt}       3290 {c |}{res}          1        0.00       25.48
{txt}       3300 {c |}{res}         55        0.06       25.54
{txt}       3304 {c |}{res}          1        0.00       25.54
{txt}       3325 {c |}{res}          1        0.00       25.54
{txt}       3330 {c |}{res}          1        0.00       25.54
{txt}       3333 {c |}{res}          1        0.00       25.54
{txt}       3344 {c |}{res}          1        0.00       25.54
{txt}       3350 {c |}{res}          1        0.00       25.55
{txt}       3390 {c |}{res}          5        0.01       25.55
{txt}       3400 {c |}{res}         28        0.03       25.58
{txt}       3428 {c |}{res}          1        0.00       25.58
{txt}       3433 {c |}{res}          1        0.00       25.59
{txt}       3448 {c |}{res}          2        0.00       25.59
{txt}       3450 {c |}{res}          1        0.00       25.59
{txt}       3456 {c |}{res}          1        0.00       25.59
{txt}       3500 {c |}{res}        224        0.26       25.85
{txt}       3520 {c |}{res}          1        0.00       25.85
{txt}       3540 {c |}{res}          1        0.00       25.85
{txt}       3565 {c |}{res}          1        0.00       25.85
{txt}       3580 {c |}{res}          1        0.00       25.85
{txt}       3600 {c |}{res}         34        0.04       25.89
{txt}       3610 {c |}{res}          1        0.00       25.89
{txt}       3650 {c |}{res}          2        0.00       25.90
{txt}       3660 {c |}{res}          1        0.00       25.90
{txt}       3672 {c |}{res}          1        0.00       25.90
{txt}       3680 {c |}{res}          1        0.00       25.90
{txt}       3700 {c |}{res}         15        0.02       25.92
{txt}       3720 {c |}{res}          1        0.00       25.92
{txt}       3729 {c |}{res}          1        0.00       25.92
{txt}       3750 {c |}{res}          1        0.00       25.92
{txt}       3800 {c |}{res}         52        0.06       25.98
{txt}       3820 {c |}{res}          1        0.00       25.98
{txt}       3850 {c |}{res}          3        0.00       25.98
{txt}       3880 {c |}{res}          2        0.00       25.99
{txt}       3892 {c |}{res}          1        0.00       25.99
{txt}       3893 {c |}{res}          1        0.00       25.99
{txt}       3896 {c |}{res}          1        0.00       25.99
{txt}       3900 {c |}{res}         11        0.01       26.00
{txt}       3908 {c |}{res}          1        0.00       26.00
{txt}       3955 {c |}{res}          2        0.00       26.01
{txt}       3977 {c |}{res}          1        0.00       26.01
{txt}       3980 {c |}{res}          1        0.00       26.01
{txt}       4000 {c |}{res}        205        0.24       26.24
{txt}       4022 {c |}{res}          4        0.00       26.25
{txt}       4023 {c |}{res}          2        0.00       26.25
{txt}       4048 {c |}{res}          1        0.00       26.25
{txt}       4050 {c |}{res}          2        0.00       26.26
{txt}       4060 {c |}{res}          1        0.00       26.26
{txt}       4100 {c |}{res}         13        0.01       26.27
{txt}       4110 {c |}{res}          1        0.00       26.27
{txt}       4120 {c |}{res}          1        0.00       26.27
{txt}       4200 {c |}{res}         45        0.05       26.33
{txt}       4220 {c |}{res}          1        0.00       26.33
{txt}       4250 {c |}{res}          2        0.00       26.33
{txt}       4270 {c |}{res}          1        0.00       26.33
{txt}       4294 {c |}{res}          1        0.00       26.33
{txt}       4300 {c |}{res}         17        0.02       26.35
{txt}       4320 {c |}{res}          1        0.00       26.35
{txt}       4368 {c |}{res}          1        0.00       26.35
{txt}       4372 {c |}{res}          1        0.00       26.35
{txt}       4400 {c |}{res}          8        0.01       26.36
{txt}       4440 {c |}{res}          1        0.00       26.36
{txt}       4444 {c |}{res}          1        0.00       26.37
{txt}       4470 {c |}{res}          1        0.00       26.37
{txt}       4479 {c |}{res}          1        0.00       26.37
{txt}       4484 {c |}{res}          1        0.00       26.37
{txt}       4500 {c |}{res}         82        0.09       26.46
{txt}       4507 {c |}{res}          1        0.00       26.46
{txt}       4518 {c |}{res}          1        0.00       26.47
{txt}       4520 {c |}{res}          1        0.00       26.47
{txt}       4571 {c |}{res}          1        0.00       26.47
{txt}       4598 {c |}{res}          1        0.00       26.47
{txt}       4600 {c |}{res}         13        0.01       26.48
{txt}       4650 {c |}{res}          1        0.00       26.49
{txt}       4655 {c |}{res}          1        0.00       26.49
{txt}       4658 {c |}{res}          1        0.00       26.49
{txt}       4688 {c |}{res}          1        0.00       26.49
{txt}       4700 {c |}{res}          9        0.01       26.50
{txt}       4750 {c |}{res}          1        0.00       26.50
{txt}       4787 {c |}{res}          1        0.00       26.50
{txt}       4800 {c |}{res}         20        0.02       26.52
{txt}       4831 {c |}{res}          1        0.00       26.53
{txt}       4850 {c |}{res}          1        0.00       26.53
{txt}       4859 {c |}{res}          1        0.00       26.53
{txt}       4885 {c |}{res}          1        0.00       26.53
{txt}       4900 {c |}{res}          3        0.00       26.53
{txt}       4931 {c |}{res}          1        0.00       26.53
{txt}       4980 {c |}{res}          2        0.00       26.54
{txt}       4998 {c |}{res}          1        0.00       26.54
{txt}       5000 {c |}{res}        148        0.17       26.71
{txt}       5020 {c |}{res}          1        0.00       26.71
{txt}       5036 {c |}{res}          1        0.00       26.71
{txt}       5048 {c |}{res}          1        0.00       26.71
{txt}       5050 {c |}{res}          1        0.00       26.71
{txt}       5064 {c |}{res}          1        0.00       26.71
{txt}       5100 {c |}{res}          6        0.01       26.72
{txt}       5150 {c |}{res}          1        0.00       26.72
{txt}       5195 {c |}{res}          1        0.00       26.72
{txt}       5200 {c |}{res}          6        0.01       26.73
{txt}       5250 {c |}{res}          1        0.00       26.73
{txt}       5300 {c |}{res}          6        0.01       26.74
{txt}       5340 {c |}{res}          1        0.00       26.74
{txt}       5366 {c |}{res}          1        0.00       26.74
{txt}       5400 {c |}{res}          2        0.00       26.74
{txt}       5450 {c |}{res}          1        0.00       26.74
{txt}       5500 {c |}{res}         35        0.04       26.78
{txt}       5555 {c |}{res}          1        0.00       26.79
{txt}       5600 {c |}{res}          6        0.01       26.79
{txt}       5605 {c |}{res}          1        0.00       26.79
{txt}       5620 {c |}{res}          1        0.00       26.79
{txt}       5650 {c |}{res}          1        0.00       26.80
{txt}       5700 {c |}{res}          3        0.00       26.80
{txt}       5800 {c |}{res}          9        0.01       26.81
{txt}       5820 {c |}{res}          1        0.00       26.81
{txt}       5835 {c |}{res}          1        0.00       26.81
{txt}       5856 {c |}{res}          1        0.00       26.81
{txt}       6000 {c |}{res}         72        0.08       26.90
{txt}       6027 {c |}{res}          1        0.00       26.90
{txt}       6050 {c |}{res}          1        0.00       26.90
{txt}       6100 {c |}{res}          1        0.00       26.90
{txt}       6106 {c |}{res}          1        0.00       26.90
{txt}       6170 {c |}{res}          1        0.00       26.90
{txt}       6200 {c |}{res}          2        0.00       26.90
{txt}       6280 {c |}{res}          1        0.00       26.90
{txt}       6300 {c |}{res}          1        0.00       26.91
{txt}       6321 {c |}{res}          1        0.00       26.91
{txt}       6400 {c |}{res}          4        0.00       26.91
{txt}       6480 {c |}{res}          3        0.00       26.92
{txt}       6500 {c |}{res}         21        0.02       26.94
{txt}       6650 {c |}{res}          1        0.00       26.94
{txt}       6700 {c |}{res}          2        0.00       26.94
{txt}       6720 {c |}{res}          1        0.00       26.94
{txt}       6750 {c |}{res}          2        0.00       26.95
{txt}       6800 {c |}{res}          5        0.01       26.95
{txt}       6815 {c |}{res}          1        0.00       26.95
{txt}       6950 {c |}{res}          1        0.00       26.95
{txt}       6966 {c |}{res}          1        0.00       26.96
{txt}       7000 {c |}{res}         41        0.05       27.00
{txt}       7100 {c |}{res}          1        0.00       27.00
{txt}       7135 {c |}{res}          1        0.00       27.01
{txt}       7300 {c |}{res}          1        0.00       27.01
{txt}       7400 {c |}{res}          1        0.00       27.01
{txt}       7500 {c |}{res}         16        0.02       27.03
{txt}       7557 {c |}{res}          1        0.00       27.03
{txt}       7800 {c |}{res}          2        0.00       27.03
{txt}       8000 {c |}{res}         52        0.06       27.09
{txt}       8045 {c |}{res}          1        0.00       27.09
{txt}       8102 {c |}{res}          1        0.00       27.09
{txt}       8500 {c |}{res}          8        0.01       27.10
{txt}       8600 {c |}{res}          1        0.00       27.10
{txt}       8700 {c |}{res}          3        0.00       27.11
{txt}       8800 {c |}{res}          5        0.01       27.11
{txt}       8900 {c |}{res}          1        0.00       27.11
{txt}       9000 {c |}{res}         12        0.01       27.13
{txt}       9500 {c |}{res}          5        0.01       27.13
{txt}       9600 {c |}{res}          1        0.00       27.13
{txt}       9700 {c |}{res}          1        0.00       27.13
{txt}       9742 {c |}{res}          1        0.00       27.14
{txt}       9775 {c |}{res}          1        0.00       27.14
{txt}      10000 {c |}{res}         25        0.03       27.17
{txt}      11000 {c |}{res}          3        0.00       27.17
{txt}      11070 {c |}{res}          1        0.00       27.17
{txt}      11186 {c |}{res}          1        0.00       27.17
{txt}      11300 {c |}{res}          1        0.00       27.17
{txt}      11500 {c |}{res}          1        0.00       27.17
{txt}      12000 {c |}{res}         10        0.01       27.18
{txt}      12500 {c |}{res}          3        0.00       27.19
{txt}      12900 {c |}{res}          1        0.00       27.19
{txt}      13000 {c |}{res}          3        0.00       27.19
{txt}      14760 {c |}{res}          1        0.00       27.19
{txt}      14800 {c |}{res}          1        0.00       27.20
{txt}      15000 {c |}{res}          8        0.01       27.20
{txt}      15500 {c |}{res}          1        0.00       27.21
{txt}      16000 {c |}{res}          1        0.00       27.21
{txt}      18000 {c |}{res}          1        0.00       27.21
{txt}      19450 {c |}{res}          1        0.00       27.21
{txt}      20000 {c |}{res}          1        0.00       27.21
{txt}      30000 {c |}{res}          1        0.00       27.21
{txt}          . {c |}{res}     63,185       72.79      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     86,806      100.00
{txt}
{com}. //_26
. net search poverty
{txt}(contacting http://www.stata.com)

{s6hlp}
51 packages found (Stata Journal listed first)
----------------------------------------------

@net:describe st0492, from(http://www.stata-journal.com/software/sj17-3)!st0492 from http://www.stata-journal.com/software/sj17-3@
    SJ17-3 st0492. Estimate the entire parametric class of Alkire-Foster
    multidimensional poverty measures / Estimate the entire parametric class
    of Alkire- / Foster multidimensional poverty measures / by Daniele
    Pacifico, OECD, Paris, France / Felix Poege, Max Planck Institute for /

@net:describe st0424, from(http://www.stata-journal.com/software/sj16-1)!st0424 from http://www.stata-journal.com/software/sj16-1@
    SJ16-1 st0424. Difference-in-differences estimation /
    Difference-in-differences estimation / by Juan M. villa, Brooks World
    Poverty / Institute, University of Manchester, / Manchester, UK / Support:
    juan.villalora@@manchester.ac.uk / After installation, type help ^diff^

@net:describe sg117, from(http://www.stata.com/stb/stb51)!sg117 from http://www.stata.com/stb/stb51@
    STB-51 sg115.  Robust std errs for Foster-Greer-Thorbecke poverty ind. /
    STB insert by / Dean Jolliffe, Center for Economic Research and Graduate
    Education, / Czech Republic; / Anastassia Semykina, Center for Economic
    Research and Graduate Education, / Czech Republic. / Support:

@net:describe sg108, from(http://www.stata.com/stb/stb48)!sg108 from http://www.stata.com/stb/stb48@
    STB-48 sg108.  Computing poverty indices. / STB insert by Philippe Van
    Kerm, GREBE, University of Namur, Belgium. / Support:
    philippe.vankerm@@fundp.ac.be / After installation, see help ^poverty^.

@net:describe shapley, from(http://staskolenikov.net/stata)!shapley from http://staskolenikov.net/stata@
    shapley -- module to perform Shapley decomposition / Author: Stas
    Kolenikov, skolenik@@yahoo.com / This program performs, in some rather
    general form, Shapley value / decomposition. The goal is to analyze
    indices that do not possess / natural decomposition properties. The early

@net:describe adecomp, from(http://fmwww.bc.edu/RePEc/bocode/a)!adecomp from http://fmwww.bc.edu/RePEc/bocode/a@
    'ADECOMP': module to estimate Shapley Decomposition by Components of a
    Welfare Measure / adecomp implements the Shapley decomposition of changes
    in a / welfare indicator as proposed by Azevedo, Sanfelice and Nguyen /
    (2012). Following Barros et al. (2006), this method takes / advantage of

@net:describe apoverty, from(http://fmwww.bc.edu/RePEc/bocode/a)!apoverty from http://fmwww.bc.edu/RePEc/bocode/a@
    'APOVERTY': module to compute poverty measures / apoverty computes a
    series of poverty measures based on the / (income) distribution described
    by varname. It is a revised and / upgraded version of poverty published by
    Philippe Van Kerm.  / KW: poverty / KW: headcount / KW: Sen index / KW:

@net:describe bcstats, from(http://fmwww.bc.edu/RePEc/bocode/b)!bcstats from http://fmwww.bc.edu/RePEc/bocode/b@
    'BCSTATS': module to analyze back check (field audit) data and compare it
    to the original survey data / bcstats compares back check (i.e., field
    audit, reinterview) / data and original survey data, producing a data set
    of / comparisons. It completes enumerator checks for type 1 and type / 2

@net:describe bmp2dta, from(http://fmwww.bc.edu/RePEc/bocode/b)!bmp2dta from http://fmwww.bc.edu/RePEc/bocode/b@
    'BMP2DTA': module to convert bitmap files to Stata datasets / Since the
    advent of satellite imagery, researchers have turned / images into data
    and processed it. This program makes the first / step easier in Stata, by
    turning a Windows 24-bit bitmap file / into a Stata dataset with variables

@net:describe cfby, from(http://fmwww.bc.edu/RePEc/bocode/c)!cfby from http://fmwww.bc.edu/RePEc/bocode/c@
    'CFBY': module to compare datasets and produce discrepancy rates / cfby
    compares the variables in varlist from the dataset in / memory to the
    variables in varlist from the using dataset and / displays the discrepancy
    rates by a common variable.  It is / useful if you are doing data entry

@net:describe cfout, from(http://fmwww.bc.edu/RePEc/bocode/c)!cfout from http://fmwww.bc.edu/RePEc/bocode/c@
    'CFOUT': module to compare two datasets, saving a list of differences /
    cfout compares the dataset in memory (the master dataset) to a / using
    dataset. It uses unique ID variables to match observations. / cfout
    optionally saves the list of differences to file.  / KW: data management /

@net:describe changemean, from(http://fmwww.bc.edu/RePEc/bocode/c)!changemean from http://fmwww.bc.edu/RePEc/bocode/c@
    'CHANGEMEAN': module to compute Income and Inequality Contribution on
    Poverty Variation / changemean decompose the poverty gap among two or more
    subgroups / by income and inequality.  / KW: poverty gap / KW: inequality
    / KW: income distribution / Requires: Stata version 8.0 /

@net:describe diff, from(http://fmwww.bc.edu/RePEc/bocode/d)!diff from http://fmwww.bc.edu/RePEc/bocode/d@
    'DIFF': module to perform Differences in Differences estimation / diff
    performs several differences in differences (diff-in-diff) / estimations
    of the treatment effect of a given outcome variable / from a pooled base
    line and follow up dataset: Single / Diff-in-Diff, Diff-in-Diff

@net:describe drdecomp, from(http://fmwww.bc.edu/RePEc/bocode/d)!drdecomp from http://fmwww.bc.edu/RePEc/bocode/d@
    'DRDECOMP': module to estimate Shapley value of growth and distribution
    components of changes in poverty indicators / drdecomp implements the
    shapley value of the Datt and Ravallion / (1992) decomposition of changes
    in a welfare indicator into / growth and distribution, however, following

@net:describe dstat, from(http://fmwww.bc.edu/RePEc/bocode/d)!dstat from http://fmwww.bc.edu/RePEc/bocode/d@
    'DSTAT': module to compute summary statistics and distribution functions
    including standard errors and optional covariate balancing / dstat unites
    a variety of methods to describe (univariate) / statistical distributions.
    Covered are density estimation, / histograms, cumulative distribution

@net:describe egen_inequal, from(http://fmwww.bc.edu/RePEc/bocode/e)!egen_inequal from http://fmwww.bc.edu/RePEc/bocode/e@
    'EGEN_INEQUAL': module providing extensions to generate inequality and
    poverty measures / The set of programs in this package uses egen to create
    newvar of / the optionally specified storage type equal to one of the /
    standard inequality and Foster-Greer-Thorbecke (FGT) poverty / measures.

@net:describe fgt_ci, from(http://fmwww.bc.edu/RePEc/bocode/f)!fgt_ci from http://fmwww.bc.edu/RePEc/bocode/f@
    'FGT_CI': module to calculate and decompose Foster뉺reer늆horbecke
    (and standard) concentration indices / This command combines two of the
    most widely used measures in / the inequality and poverty literatures: the
    concentration / index (CI) and the Foster뉺reer늆horbecke (FGT)

@net:describe fpro, from(http://fmwww.bc.edu/RePEc/bocode/f)!fpro from http://fmwww.bc.edu/RePEc/bocode/f@
    'FPRO': module to compute Financial Protection Indicators for Health
    Expenditures / The package contains two commands (fpcata and fpimpov) to /
    compute indicators of financial protection for health / expenditures.
    fpcata computes the incidence of 'catastrophic' / health spending (the %

@net:describe getcensus, from(http://fmwww.bc.edu/RePEc/bocode/g)!getcensus from http://fmwww.bc.edu/RePEc/bocode/g@
    'GETCENSUS': module to load American Community Survey data from the U.S.
    Census Bureau API into Stata / getcensus is a Stata package for loading
    American Community / Survey (ACS) data from the U.S. Census Bureau API
    into Stata. It / also allows users to search the API data dictionaries for

@net:describe glcurve, from(http://fmwww.bc.edu/RePEc/bocode/g)!glcurve from http://fmwww.bc.edu/RePEc/bocode/g@
    'GLCURVE': module to derive generalised Lorenz curve ordinates / Given
    variable varname, call it x with c.d.f. F(x), glcurve / either draws its
    Generalised Lorenz curve or generates two new / variables containing the
    Generalised Lorenz ordinates for x, i.e. / GL(p) at each p = F(x) (or

@net:describe glcurve5, from(http://fmwww.bc.edu/RePEc/bocode/g)!glcurve5 from http://fmwww.bc.edu/RePEc/bocode/g@
    'GLCURVE5': module to derive generalised Lorenz curve ordinates with unit
    record data (Stata 5 or 6) / Given a variable varname, call it x with
    c.d.f. F(x), glcurve7 / draws its Generalised Lorenz curve and/or
    generates two new / variables containing the Generalised Lorenz ordinates

@net:describe glcurve7, from(http://fmwww.bc.edu/RePEc/bocode/g)!glcurve7 from http://fmwww.bc.edu/RePEc/bocode/g@
    'GLCURVE7': module to derive generalised Lorenz curve ordinates with unit
    record data (version 7) / Given a variable varname, call it x with c.d.f.
    F(x), glcurve7 / draws its Generalised Lorenz curve and/or generates two
    new / variables containing the Generalised Lorenz ordinates for x, i.e. /

@net:describe hoishapely, from(http://fmwww.bc.edu/RePEc/bocode/h)!hoishapely from http://fmwww.bc.edu/RePEc/bocode/h@
    'HOISHAPELY': module to perform Shapley Decomposition of the Human
    Opportunity Index / hoishapley computes the Shapley decomposition of the
    Human / Opportunity Index (HOI), it includes the estimation of the basic /
    statistics like Coverage of Basic Opportunities (C), the / Dissimilarity

@net:describe hoishapley, from(http://fmwww.bc.edu/RePEc/bocode/h)!hoishapley from http://fmwww.bc.edu/RePEc/bocode/h@
    'HOISHAPLEY': module to perform Shapley Decomposition of the Human
    Opportunity Index / hoishapley computes the Shapley decomposition of the
    Human / Opportunity Index (HOI), it includes the estimation of the basic /
    statistics like Coverage of Basic Opportunities (C), the / Dissimilarity

@net:describe ipabcstats, from(http://fmwww.bc.edu/RePEc/bocode/i)!ipabcstats from http://fmwww.bc.edu/RePEc/bocode/i@
    'IPABCSTATS': module to compare survey and back check data, producing an
    Excel output of comparisons and error rates / ipabcstats compares back
    check data and survey data, producing / a data set of comparisons.  It
    completes enumerator checks for / type 1 and type 2 variables and

@net:describe isopoverty, from(http://fmwww.bc.edu/RePEc/bocode/i)!isopoverty from http://fmwww.bc.edu/RePEc/bocode/i@
    'ISOPOVERTY': module to generate data for Inequality-Poverty and
    Iso-Poverty curves / isopoverty generates data that can be used to plot
    the / Inequality-Poverty, Growth-Poverty and the Iso-Poverty curves. /
    stepgrw or stepinq have to be stated otherwise the programme does / not

@net:describe kanom, from(http://fmwww.bc.edu/RePEc/bocode/k)!kanom from http://fmwww.bc.edu/RePEc/bocode/k@
    'KANOM': module to estimate Krippendorff's alpha for nominal variables /
    kanom computes points estimates and 95 percent confidence / intervals for
    Krippendorff's reliability coefficient alpha, for / nominal variables and
    two measurements. It also tests the null / hypotheses that alpha is not

@net:describe mergeall, from(http://fmwww.bc.edu/RePEc/bocode/m)!mergeall from http://fmwww.bc.edu/RePEc/bocode/m@
    'MERGEALL': module to merge multiple files / mergeall merges all of the
    files in a folder without loss of / data due to variable storage types or
    duplicate unique / identifiers.  / KW: data management / KW: merge /
    Requires: Stata version 10.1 / Distribution-Date: 20110708 / Author: Ryan

@net:describe mpi, from(http://fmwww.bc.edu/RePEc/bocode/m)!mpi from http://fmwww.bc.edu/RePEc/bocode/m@
    'MPI': module to compute the Alkire-Foster multidimensional poverty
    measures and their decomposition by deprivation indicators and population
    sub-groups / MPI estimates the Adjusted Multidimensional Headcount Ratio /
    developed by Alkire and Foster (2011), also known as the /

@net:describe mpitb, from(http://fmwww.bc.edu/RePEc/bocode/m)!mpitb from http://fmwww.bc.edu/RePEc/bocode/m@
    'MPITB': module to estimate and analyze multidimensional poverty indices
    (MPI) / mpitb is a toolbox that offers several commands to facilitate /
    specification, estimation, and analysis of multidimensional / poverty
    indices (MPI) and supports the popular Alkire-Foster (AF) / framework to

@net:describe mpovline, from(http://fmwww.bc.edu/RePEc/bocode/m)!mpovline from http://fmwww.bc.edu/RePEc/bocode/m@
    'MPOVLINE': module to calculate FGT0, FGT1 and FGT2 by intervals of
    multiple thresholds / mpovline calculates FGT0, FGT1 and FGT2 by intervals
    of multiple / lines. This ado can be used to calculate headcount for the
    poor, / vulnerable and middle class lines as proposed by Ferreira et al /

@net:describe orth_out, from(http://fmwww.bc.edu/RePEc/bocode/o)!orth_out from http://fmwww.bc.edu/RePEc/bocode/o@
    'ORTH_OUT': module to automate and export summary stats/orthogonality
    tables / orth_out produces summary stats tables and orthogonality tables.
    / orth_out is useful in testing balance of means across variables / in
    multiple groups, particularly the balance of baseline / characteristics

@net:describe outdetect, from(http://fmwww.bc.edu/RePEc/bocode/o)!outdetect from http://fmwww.bc.edu/RePEc/bocode/o@
    'OUTDETECT': module to perform outlier detection and diagnostics for
    welfare analysts / outdetect identifies outliers (extreme values) in the /
    distribution of a variable, and assesses their impact on a / selection of
    popular inequality and poverty measures. The / procedure by which outliers

@net:describe pobrezaecu, from(http://fmwww.bc.edu/RePEc/bocode/p)!pobrezaecu from http://fmwww.bc.edu/RePEc/bocode/p@
    'POBREZAECU': module to predict poverty in Ecuador / pobrezaECU predicts
    income poverty in Ecuador, a year ahead, / from the quarterly household
    survey called ENEMDU.  / KW: poverty / KW: Ecuador / KW: prediction /
    Requires: Stata version 12 / Distribution-Date: 20180512 / Author:  Daniel

@net:describe povcalnet, from(http://fmwww.bc.edu/RePEc/bocode/p)!povcalnet from http://fmwww.bc.edu/RePEc/bocode/p@
    'POVCALNET': module to access World Bank Global Poverty and Inequality
    measures / The povcalnet commands allows Stata users to compute poverty /
    and inequality indicators for more than 160 countries and / regions in the
    World Bank's database of household surveys. It has / the same

@net:describe povdeco, from(http://fmwww.bc.edu/RePEc/bocode/p)!povdeco from http://fmwww.bc.edu/RePEc/bocode/p@
    'POVDECO': module to calculate poverty indices with decomposition by
    subgroup / povdeco estimates three poverty indices from the Foster, /
    Greer and Thorbecke (1984) class, FGT(a), plus related / statistics (such
    as mean income amongst the poor). FGT(0) is / the headcount ratio (the

@net:describe poverty, from(http://fmwww.bc.edu/RePEc/bocode/p)!poverty from http://fmwww.bc.edu/RePEc/bocode/p@
    'POVERTY': module to calculate poverty measures / poverty computes a
    series of poverty measures based on the / (income) distribution described
    by varname. The poverty measures / that can be computed by poverty are:
    headcount ratio, / aggregate poverty gap, poverty gap ratio, income gap

@net:describe povguide, from(http://fmwww.bc.edu/RePEc/bocode/p)!povguide from http://fmwww.bc.edu/RePEc/bocode/p@
    'POVGUIDE': module to generate the U.S. Poverty Guideline value for a
    given family size and year / This generates the official Poverty Guideline
    value as / established by the United States Department of Health and Human
    / Services. This is one of two official poverty levels, the other / being

@net:describe povimp, from(http://fmwww.bc.edu/RePEc/bocode/p)!povimp from http://fmwww.bc.edu/RePEc/bocode/p@
    'POVIMP': module to provide poverty estimates in the absence of actual
    consumption data / povimp provides poverty estimates in the absence of
    actual / consumption data.  / KW: poverty / KW: imputation / KW:
    consumption / KW: inequality / Requires: Stata version 12 /

@net:describe povtime, from(http://fmwww.bc.edu/RePEc/bocode/p)!povtime from http://fmwww.bc.edu/RePEc/bocode/p@
    'POVTIME': module to compute aggregate intertemporal poverty measures
    (poverty in a panel accounting for time) / povtime computes aggregate
    intertemporal poverty measures / (poverty accounting for time) in a
    balanced panel of individuals. / The program computes the family of

@net:describe prosperity, from(http://fmwww.bc.edu/RePEc/bocode/p)!prosperity from http://fmwww.bc.edu/RePEc/bocode/p@
    'PROSPERITY': module to compute Shared Prosperity Convergence Index / The
    command prosperity calculates the Shared Prosperity / Convergence Index
    -SPCI-. This is the new indicator that the / World Bank uses to measure
    the progress in the growth and / inequality reduction.  The base indicator

@net:describe quantiles, from(http://fmwww.bc.edu/RePEc/bocode/q)!quantiles from http://fmwww.bc.edu/RePEc/bocode/q@
    'QUANTILES': module to categorize by quantiles / quantiles creates a new
    variable (newvar) that categorizes / varname by its quantiles. It differs
    from xtile because the / categories are defined by the ideal size of the
    quantile rather / than by the cutpoints, therefore yielding less unequaly

@net:describe rddsga, from(http://fmwww.bc.edu/RePEc/bocode/r)!rddsga from http://fmwww.bc.edu/RePEc/bocode/r@
    'RDDSGA': module to conduct subgroup analysis for regression discontinuity
    designs / rddsga allows to conduct a binary subgroup analysis in RDD /
    settings based on inverse propensity score weights (IPSW).  / Observations
    in each subgroup are weighted by the inverse of / their conditional

@net:describe readreplace, from(http://fmwww.bc.edu/RePEc/bocode/r)!readreplace from http://fmwww.bc.edu/RePEc/bocode/r@
    'READREPLACE': module to make replacements that are specified in an
    external dataset / eadreplace modifies the dataset currently in memory by
    making / replacements that are specified in an external dataset, the /
    replacements file.  / KW: data management / KW: data entry / KW: replace /

@net:describe sae, from(http://fmwww.bc.edu/RePEc/bocode/s)!sae from http://fmwww.bc.edu/RePEc/bocode/s@
    'SAE': module to provide commands and mata functions devoted to unit level
    small area estimation / sae is a Stata family of functions for small area
    estimation, / using the methodology from Elbers, Lanjouw, and Lanjouw
    (2003). / The package introduces new mata functions and a plugin used to /

@net:describe skdecomp, from(http://fmwww.bc.edu/RePEc/bocode/s)!skdecomp from http://fmwww.bc.edu/RePEc/bocode/s@
    'SKDECOMP': module to estimate Shapley value of growth, price, and
    distribution components on changes in poverty indicators / skdecomp
    implements the shapley value of Kolenikov and / Shorrocks (2003)
    decomposition of changes in a welfare indicator / into growth,

@net:describe specialexp, from(http://fmwww.bc.edu/RePEc/bocode/s)!specialexp from http://fmwww.bc.edu/RePEc/bocode/s@
    'SPECIALEXP': module to obtain expression that evaluates to specified
    string / specialexp returns an expression that evaluates to a specified /
    string, including strings that cannot be enclosed in double / quotes.  /
    KW: expressions / KW: quotes / KW: Mata / Requires: Stata version 9 /

@net:describe tex3pt, from(http://fmwww.bc.edu/RePEc/bocode/t)!tex3pt from http://fmwww.bc.edu/RePEc/bocode/t@
    'TEX3PT': module to produce LaTeX documents from estout with
    threeparttable / tex3pt takes .tex output from esttab and writes it into a
    LaTeX / file using threeparttable. This greatly improves the level of /
    compatibility between LaTeX and esttab.  Since this program uses / the

@net:describe veracrypt, from(http://fmwww.bc.edu/RePEc/bocode/v)!veracrypt from http://fmwww.bc.edu/RePEc/bocode/v@
    'VERACRYPT': module to mount or dismount a VeraCrypt volume / veracrypt
    mounts or dismounts a VeraCrypt volume.  / KW: veracrypt / KW: data
    management / Requires: Stata version 9 / Distribution-Date: 20160926 /
    Author:  Patrick McNeal, Abdul Latif Jameel Poverty Action Lab, MIT /

@net:describe st0543, from(http://www.stata-journal.com/software/sj18-4)!st0543 from http://www.stata-journal.com/software/sj18-4@
    SJ18-4 st0543. Fit dynamic random-effects probit... / Fit dynamic
    random-effects probit models with / unobserved heterogeneity / by Raffaele
    Grotti, / Department of Political and Social Sciences / European
    University Institute / San Domenico di Fiesole, Italy / Giorgio Cutuli,

@net:describe xtpdyn, from(http://fmwww.bc.edu/RePEc/bocode/x)!xtpdyn from http://fmwww.bc.edu/RePEc/bocode/x@
    'XTPDYN': module to estimate dynamic random effects probit model with
    unobserved heterogeneity / xtpdyn fits dynamic random-effects probit
    models (meprobit and / xtprobit) with unobserved heterogeneity. It
    implements Wooldridge / simple solution to the initial condition problem


11 references found in tables of contents
-----------------------------------------

@net:from http://www.stata-journal.com/software/sj17-3/!http://www.stata-journal.com/software/sj17-3/@
    Stata Journal volume 17, issue 3 / Update: A set of utilities for managing
    / missing values / Update: Design plots for graphical summary / of a
    response given factors / Update: One-, two-, and three-way bar charts /
    for tables / Provide graph schemes sensitive to color / vision deficiency

@net:from http://www.stata.com/stb/stb51/!http://www.stata.com/stb/stb51/@
    STB-51 September 1999 / Update to defv / Update to labedit / Update to
    varxplor / Update of cut to Stata 6 / Calculating the product of
    observations / Alternative ranking procedures / 3D surface plots / A
    simple contour plot / Distribution function plots / Quantile plots,

@net:from http://www.stata.com/stb/stb48/!http://www.stata.com/stb/stb48/@
    STB-48 March 1999 / Drawing Venn diagrams / Diagnostic plots for
    Singh-Maddala and Dagum distrib / Analysis of income distributions /
    Creation of bivariate random lognormal variables / Fitting Singh-Maddala
    and Dagum distrib. by max. like. / Generalized Lorenz curves and related

@net:from http://fmwww.bc.edu/RePEc/bocode/a/!http://fmwww.bc.edu/RePEc/bocode/a/@
    module to estimate models with two fixed effects / module to compute
    unbiased IV regression / module for scatter plot with linear and/or
    quadratic fit, automatically annotated / module to perform Arellano-Bond
    test for autocorrelation / module to implement the Alpha-Beta-Gamma Method

@net:from http://fmwww.bc.edu/RePEc/bocode/c/!http://fmwww.bc.edu/RePEc/bocode/c/@
    module to implement machine learning classification in Stata / module to
    implement machine learning classification in Stata / module to generate
    calendar / module to estimate proportions and means after survey data have
    been calibrated to population totals / module for inverse regression and

@net:from http://fmwww.bc.edu/RePEc/bocode/d/!http://fmwww.bc.edu/RePEc/bocode/d/@
    module to create network visualizations using D3.js to view in browser /
    module to produce terrible dad jokes / module to provide utilities for
    directed acyclic graphs / module to fit a Generalized Beta (Type 2)
    distribution to grouped data via ML / module to fit a Dagum distribution

@net:from http://fmwww.bc.edu/RePEc/bocode/e/!http://fmwww.bc.edu/RePEc/bocode/e/@
    module to estimate endogenous attribute attendance models / module to
    perform extreme bound analysis / module to perform Entropy reweighting to
    create balanced samples / module to perform entropy balancing / module to
    perform entropy reweighting to create balanced samples for continuous

@net:from http://fmwww.bc.edu/RePEc/bocode/i/!http://fmwww.bc.edu/RePEc/bocode/i/@
    module to import International Aid Transparency Initiative data / module
    to compute measures of interaction contrast (biological interaction) /
    module to compute Interaction Effects in Linear and Generalized Linear
    Models / module that computes models 2 and 3 of the intra-class

@net:from http://fmwww.bc.edu/RePEc/bocode/m/!http://fmwww.bc.edu/RePEc/bocode/m/@
    module to implement interpoint distance distribution analysis / module to
    unabbreviate Global Macro Lists / module to compute the macroF evaluation
    criterion for multi-class outcomes / module to perform Dickey-Fuller test
    on panel data / module to create dot plot for summarizing pooled estimates

@net:from http://fmwww.bc.edu/RePEc/bocode/p/!http://fmwww.bc.edu/RePEc/bocode/p/@
    module to calculate confidence limits of a regression coefficient from the
    p-value / module to perform Page's L trend test for ordered alternatives /
    module to create paired datasets from individual-per-row data / module for
    plots of paired observations / module to import network data in Pajek's

@net:from http://fmwww.bc.edu/RePEc/bocode/s/!http://fmwww.bc.edu/RePEc/bocode/s/@
    module to compute Sequence Analysis Distance Measures / module to provide
    commands and mata functions devoted to unit level small area estimation /
    module to compute sample size for an intra-class correlation (ICC) /
    module to draw a random sample with probabilities proportional to size /

{smcl}

{com}. ssc install povdeco
{txt}checking {hilite:povdeco} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. //_27q
. quietly: cd "C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\jtvalderrama.github.io"
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jvald\Dropbox\MISCURSOS\Analisis de Datos con Stata\jtvalderrama.github.io\stata1.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Jan 2023, 17:05:17
{txt}{.-}
{smcl}
{txt}{sf}{ul off}